{
  "GUCY1A1": "GUCY1A1 encodes the alpha-1 subunit of soluble guanylate cyclase, a key enzyme in the nitric oxide signaling pathway involved in vascular regulation and cellular signaling. In NSCLC, altered expression or mutations in GUCY1A1 have been associated with tumor progression and resistance to apoptosis, potentially impacting tumor aggressiveness. Its dysregulation may influence patient survival by modulating tumor microenvironment and responsiveness to targeted therapies, making it a candidate biomarker for prognosis and therapeutic stratification.",
  "GPC3": "GPC3 (Glypican-3) is a cell surface heparan sulfate proteoglycan involved in regulating cell growth and differentiation. In NSCLC, aberrant GPC3 expression has been associated with tumor progression and poor prognosis, potentially by modulating signaling pathways such as Wnt and Hedgehog. Elevated GPC3 levels may correlate with reduced survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "MAP2K3": "MAP2K3 is a gene encoding a kinase involved in the MAPK signaling pathway, which regulates cellular responses to stress and inflammation. In NSCLC, aberrant MAP2K3 activity has been linked to tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Its expression or mutation status may influence patient survival by modulating tumor aggressiveness and response to targeted therapies.",
  "Stage_IA": "\"Stage_IA\" is a clinical variable representing early-stage non-small cell lung cancer (NSCLC) where the tumor is confined to the lung without lymph node involvement or metastasis. Patients diagnosed at Stage IA generally have a favorable prognosis and are often candidates for surgical resection with curative intent. Early detection at this stage is associated with significantly improved survival outcomes compared to more advanced stages.",
  "TENT5C": "TENT5C is a gene encoding a non-canonical poly(A) polymerase involved in RNA stability and regulation. In NSCLC, altered expression or mutations in TENT5C have been associated with tumor progression and may impact response to therapy. Its dysregulation can influence patient survival by affecting cancer cell proliferation and resistance mechanisms, making it a potential prognostic biomarker.",
  "MCTP1": "MCTP1 is a gene encoding a calcium-binding transmembrane protein involved in intracellular signaling pathways. In NSCLC, altered expression or mutations in MCTP1 have been associated with tumor progression and may correlate with poorer prognosis. Its dysregulation could influence cancer cell survival and resistance mechanisms, thereby impacting overall patient survival outcomes.",
  "FAM13C": "FAM13C is a gene implicated in cellular signaling pathways that may influence tumor progression in non-small cell lung cancer (NSCLC). Emerging evidence suggests that altered expression of FAM13C correlates with tumor aggressiveness and could serve as a prognostic biomarker. Its dysregulation may impact patient survival by modulating pathways involved in cancer cell proliferation and metastasis.",
  "NR3C2": "NR3C2 encodes the mineralocorticoid receptor, a nuclear hormone receptor involved in regulating electrolyte balance and cellular stress responses. In NSCLC, altered NR3C2 expression or mutation has been associated with tumor progression and poorer prognosis, potentially by influencing tumor microenvironment and resistance to therapy. Its status may serve as a prognostic biomarker, where decreased NR3C2 activity correlates with reduced overall survival and could guide personalized treatment strategies.",
  "ZNF507": "ZNF507 is a gene encoding a zinc finger protein involved in transcriptional regulation. In the context of NSCLC, altered expression or mutation of ZNF507 has been associated with tumor progression and poorer prognosis, potentially by influencing pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and could impact patient survival by promoting resistance to conventional therapies.",
  "PDLIM2": "PDLIM2 is a gene encoding a protein involved in cytoskeletal organization and regulation of NF-κB signaling. In NSCLC, altered PDLIM2 expression has been associated with tumor progression and immune evasion, potentially impacting response to immunotherapy. Its dysregulation may correlate with poorer survival outcomes by promoting a more aggressive tumor phenotype and resistance to apoptosis.",
  "ASB8": "ASB8 is a gene encoding a member of the ankyrin repeat and SOCS box-containing protein family, involved in protein ubiquitination and degradation pathways. In NSCLC, altered ASB8 expression has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role in modulating cellular signaling pathways suggests potential influence on tumor aggressiveness and response to targeted therapies.",
  "EXOC1": "EXOC1 is a gene encoding a component of the exocyst complex involved in vesicle trafficking and membrane fusion. In NSCLC, altered EXOC1 expression has been associated with tumor progression and metastasis, potentially impacting cellular invasion mechanisms. Its dysregulation may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "FPR2": "FPR2 (Formyl Peptide Receptor 2) is a gene encoding a G-protein-coupled receptor involved in inflammatory and immune response pathways. In NSCLC, elevated FPR2 expression has been associated with tumor progression, metastasis, and a more immunosuppressive tumor microenvironment, potentially leading to poorer prognosis. Its activity may influence patient survival by promoting cancer cell invasion and resistance to therapy, making it a potential biomarker for aggressive disease and a target for novel treatments.",
  "PFKP": "PFKP encodes the platelet isoform of phosphofructokinase, a key glycolytic enzyme involved in cancer cell metabolism. In NSCLC, elevated PFKP expression is associated with enhanced tumor glycolysis, promoting aggressive tumor growth and poorer prognosis. Consequently, high PFKP levels may correlate with reduced patient survival and could serve as a potential biomarker for metabolic-targeted therapies.",
  "PALB2": "PALB2 is a gene involved in homologous recombination DNA repair, partnering with BRCA2 to maintain genomic stability. In NSCLC, PALB2 mutations or altered expression may impair DNA repair capacity, potentially increasing sensitivity to platinum-based chemotherapy and PARP inhibitors. Consequently, PALB2 status can influence patient survival by affecting tumor response to DNA-damaging treatments and overall prognosis.",
  "GPAA1": "GPAA1 is a gene encoding a subunit of the glycosylphosphatidylinositol (GPI) transamidase complex involved in anchoring proteins to the cell membrane. In NSCLC, overexpression of GPAA1 has been associated with tumor progression and poorer prognosis, likely due to its role in enhancing cancer cell adhesion and signaling pathways that promote metastasis. Elevated GPAA1 expression may therefore serve as a negative prognostic biomarker, correlating with reduced overall survival and potentially guiding more aggressive therapeutic strategies.",
  "ALDH9A1": "ALDH9A1 is a gene encoding an aldehyde dehydrogenase enzyme involved in amino acid metabolism and cellular detoxification. In NSCLC, altered expression of ALDH9A1 has been associated with tumor progression and chemoresistance, potentially serving as a biomarker for aggressive disease. Elevated ALDH9A1 activity may contribute to poorer survival outcomes by promoting cancer cell survival and resistance to therapy.",
  "CREG1": "CREG1 (Cellular Repressor of E1A-Stimulated Genes 1) is a gene involved in regulating cell growth and differentiation. In NSCLC, altered expression of CREG1 has been associated with tumor progression and may serve as a prognostic biomarker, where higher levels often correlate with improved survival outcomes. Its modulation could influence tumor aggressiveness and response to therapy, thereby impacting patient prognosis.",
  "ADGRF5": "ADGRF5 is a gene encoding an adhesion G protein-coupled receptor involved in cell signaling and immune modulation. In NSCLC, elevated ADGRF5 expression has been associated with tumor progression and poorer prognosis, potentially by promoting tumor cell migration and immune evasion. Its expression level may serve as a biomarker for aggressive disease and could influence patient survival by impacting tumor invasiveness and response to immunotherapy.",
  "RBM34": "RBM34 is a gene encoding an RNA-binding protein involved in post-transcriptional regulation of gene expression. In the context of NSCLC, altered RBM34 expression has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role in modulating RNA splicing and stability could influence tumor aggressiveness and response to therapy, thereby impacting patient prognosis.",
  "MFHAS1": "MFHAS1 is a gene encoding a protein involved in immune regulation and inflammatory signaling pathways. In the context of NSCLC, altered MFHAS1 expression has been associated with tumor progression and immune microenvironment modulation, potentially impacting tumor aggressiveness. Elevated or dysregulated MFHAS1 may correlate with poorer survival outcomes by promoting tumor growth and resistance to immune-mediated clearance.",
  "FAAP100": "FAAP100 is a gene encoding a component of the Fanconi anemia (FA) core complex involved in DNA repair through the FA pathway. In NSCLC, alterations or dysregulation of FAAP100 may impair DNA damage repair, contributing to genomic instability and potentially influencing tumor aggressiveness and resistance to platinum-based chemotherapy. Consequently, FAAP100 expression or mutation status could serve as a prognostic biomarker, where its dysfunction is associated with poorer survival outcomes due to reduced treatment efficacy.",
  "CD79A": "CD79A is a gene encoding a component of the B-cell receptor complex, primarily involved in B-cell development and signaling. In NSCLC, elevated CD79A expression often reflects increased tumor-infiltrating B-cell presence, which has been associated with improved immune response and better patient prognosis. Thus, CD79A may serve as a biomarker for favorable survival outcomes by indicating active anti-tumor immunity within the tumor microenvironment.",
  "STAT5A": "STAT5A is a gene encoding a transcription factor involved in the JAK-STAT signaling pathway, which regulates cell proliferation and apoptosis. In NSCLC, altered STAT5A expression or activation has been associated with tumor progression and resistance to therapy, potentially serving as a prognostic biomarker. Elevated STAT5A activity may correlate with poorer survival outcomes by promoting cancer cell survival and metastasis.",
  "Stage_IB": "\"Stage_IB\" is a clinical staging variable representing early-stage non-small cell lung cancer (NSCLC) where the tumor is larger than 3 cm but ≤4 cm without lymph node involvement or metastasis. This stage is significant as it typically indicates localized disease amenable to surgical resection, often associated with a relatively favorable prognosis compared to more advanced stages. However, patients with Stage IB may still have variable survival outcomes influenced by tumor biology and may benefit from adjuvant chemotherapy to reduce recurrence risk.",
  "LDLRAP1": "LDLRAP1 is a gene encoding an adaptor protein involved in low-density lipoprotein receptor (LDLR) endocytosis, impacting cellular lipid metabolism. In NSCLC, altered expression or mutations in LDLRAP1 may influence tumor cell proliferation and metabolic reprogramming, potentially affecting tumor aggressiveness. Consequently, LDLRAP1 status could serve as a prognostic biomarker, where dysregulation is associated with poorer survival outcomes due to enhanced tumor growth and resistance to therapy.",
  "SQSTM1": "SQSTM1 encodes the p62 protein, a key adaptor in autophagy and selective degradation pathways, often implicated in cellular stress responses. In NSCLC, elevated SQSTM1 expression has been associated with tumor progression and resistance to therapy, potentially promoting survival signaling and chemoresistance. Consequently, high SQSTM1 levels may correlate with poorer patient prognosis and reduced overall survival.",
  "MRPL20": "MRPL20 encodes a mitochondrial ribosomal protein involved in mitochondrial protein synthesis and energy metabolism. In NSCLC, altered expression of MRPL20 has been associated with tumor progression and poorer prognosis, likely due to its role in supporting cancer cell bioenergetics and survival. Elevated MRPL20 levels may thus correlate with reduced patient survival, making it a potential biomarker for aggressive disease and a target for metabolic-based therapies.",
  "PDCD1": "PDCD1 encodes the immune checkpoint protein PD-1, which plays a critical role in downregulating T-cell activity and maintaining immune tolerance. In NSCLC, PDCD1 expression is a key biomarker for predicting response to immune checkpoint inhibitors, with higher PD-1 levels often correlating with improved survival due to enhanced immunotherapy efficacy. Thus, PDCD1 status can influence patient outcomes by guiding immunotherapy decisions and reflecting tumor immune microenvironment activity.",
  "SLC38A6": "SLC38A6 is a gene encoding a member of the solute carrier family involved in amino acid transport. In the context of NSCLC, altered expression of SLC38A6 has been associated with tumor metabolism and may influence cancer cell proliferation. Its dysregulation could impact patient survival by modulating nutrient availability and tumor growth, making it a potential prognostic biomarker or therapeutic target.",
  "MTARC2": "MTARC2 (Mitochondrial Amidoxime Reducing Component 2) is a gene involved in mitochondrial electron transport and drug metabolism. In NSCLC, altered MTARC2 expression or mutations may impact tumor cell metabolism and response to chemotherapy, potentially serving as a prognostic biomarker. Its dysregulation could influence patient survival by affecting tumor aggressiveness and treatment efficacy.",
  "ARPP19": "ARPP19 is a gene encoding a regulatory protein involved in cell cycle progression and mitotic control. In NSCLC, elevated ARPP19 expression has been associated with increased tumor proliferation and poorer prognosis, potentially serving as a biomarker for aggressive disease. Its overexpression may contribute to reduced patient survival by promoting tumor growth and resistance to standard therapies.",
  "MRS2": "MRS2 is a gene encoding a mitochondrial magnesium transporter involved in maintaining cellular magnesium homeostasis. In NSCLC, altered MRS2 expression has been associated with tumor progression and chemoresistance, potentially impacting mitochondrial function and metabolic adaptation. Elevated MRS2 levels may correlate with poorer survival outcomes by promoting cancer cell survival and therapy resistance.",
  "PRPS2": "PRPS2 is a gene encoding phosphoribosyl pyrophosphate synthetase 2, an enzyme involved in nucleotide biosynthesis critical for DNA and RNA production. In NSCLC, elevated PRPS2 expression has been associated with enhanced tumor cell proliferation and chemoresistance, potentially leading to poorer prognosis. Thus, PRPS2 may serve as a biomarker for aggressive disease and a target for therapies aimed at improving patient survival outcomes.",
  "COL2A1": "COL2A1 encodes type II collagen, a key extracellular matrix protein primarily involved in cartilage structure, but its aberrant expression has been observed in various cancers, including NSCLC. In the context of NSCLC survival analysis, altered COL2A1 expression may reflect tumor microenvironment remodeling and has been associated with tumor progression and metastasis. Elevated or dysregulated COL2A1 levels can correlate with poorer patient prognosis by promoting invasive tumor behavior and resistance to therapy.",
  "CCDC181": "CCDC181 is a gene encoding a coiled-coil domain-containing protein, implicated in cellular structural functions. In the context of NSCLC, altered expression or mutations in CCDC181 have been associated with tumor progression and poorer prognosis. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and resistance to standard therapies.",
  "FABP6": "FABP6 (Fatty Acid Binding Protein 6) is a gene involved in intracellular lipid transport and metabolism. In NSCLC, altered FABP6 expression has been associated with tumor progression and may influence cancer cell proliferation and metastasis. Elevated FABP6 levels could correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "ZNF274": "ZNF274 is a gene encoding a zinc finger protein involved in transcriptional regulation and chromatin remodeling. In NSCLC, aberrant expression or mutation of ZNF274 has been associated with altered tumor behavior and may correlate with poor prognosis by promoting tumor progression or resistance to therapy. Its status could serve as a potential biomarker for stratifying patient survival outcomes and guiding personalized treatment strategies.",
  "OSBPL1A": "OSBPL1A is a gene encoding a member of the oxysterol-binding protein family involved in lipid transport and cellular signaling. In NSCLC, altered expression of OSBPL1A has been associated with tumor progression and may impact tumor cell metabolism and microenvironment interactions. Its dysregulation could influence patient survival by modulating pathways related to cancer cell proliferation and resistance to therapy.",
  "XPNPEP1": "XPNPEP1 encodes X-prolyl aminopeptidase 1, an enzyme involved in protein processing and degradation. In NSCLC, altered expression of XPNPEP1 has been associated with tumor progression and may impact cellular signaling pathways related to cancer cell survival. Elevated or dysregulated XPNPEP1 expression could serve as a prognostic biomarker, potentially correlating with poorer survival outcomes by promoting tumor aggressiveness or resistance to therapy.",
  "SETBP1": "SETBP1 is a gene encoding the SET binding protein 1, involved in transcriptional regulation and cellular proliferation. In NSCLC, mutations or altered expression of SETBP1 have been associated with aggressive tumor behavior and poorer prognosis, potentially due to its role in promoting oncogenic pathways. Consequently, SETBP1 status may serve as a biomarker for risk stratification and could influence survival outcomes by identifying patients with more treatment-resistant disease.",
  "DEPTOR": "DEPTOR is a gene encoding an mTOR-interacting protein that negatively regulates mTOR signaling, a pathway critical for cell growth and metabolism. In NSCLC, altered DEPTOR expression has been associated with tumor progression and resistance to targeted therapies, impacting tumor aggressiveness. Its expression levels may influence patient survival by modulating mTOR pathway activity, thereby affecting tumor proliferation and response to treatment.",
  "CGRRF1": "CGRRF1 is a gene involved in cellular growth regulation and has been implicated in tumor suppression mechanisms. In the context of NSCLC, altered expression or mutation of CGRRF1 may correlate with tumor progression and poorer prognosis. Its status could serve as a potential biomarker influencing patient survival by reflecting underlying tumor aggressiveness or response to targeted therapies.",
  "CSTF3": "CSTF3 is a gene encoding a subunit of the cleavage stimulation factor complex involved in mRNA 3' end processing, impacting gene expression regulation. In NSCLC, altered CSTF3 expression has been associated with tumor progression and may influence response to therapy by modulating oncogenic signaling pathways. Elevated CSTF3 levels can correlate with poorer survival outcomes, making it a potential prognostic biomarker and therapeutic target in NSCLC management.",
  "Age": "Age is a clinical variable representing the patient’s chronological age at diagnosis. In NSCLC, older age is generally associated with poorer prognosis due to decreased physiological reserve, higher comorbidity burden, and potential limitations in tolerating aggressive therapies. Consequently, advanced age often correlates with reduced overall survival and may influence treatment decisions and outcomes.",
  "AOC4P": "AOC4P is a long non-coding RNA (lncRNA) implicated in the regulation of tumor progression in non-small cell lung cancer (NSCLC). Emerging evidence suggests that elevated AOC4P expression is associated with enhanced tumor proliferation and metastasis, correlating with poorer overall survival. Thus, AOC4P may serve as a prognostic biomarker and potential therapeutic target influencing NSCLC patient outcomes.",
  "S100A14": "S100A14 is a gene encoding a calcium-binding protein involved in cell proliferation and metastasis regulation. In NSCLC, elevated S100A14 expression has been associated with enhanced tumor aggressiveness and poorer prognosis, potentially by promoting epithelial-mesenchymal transition and invasion. Consequently, high S100A14 levels may correlate with reduced overall survival, making it a potential biomarker for risk stratification and therapeutic targeting.",
  "ULK2": "ULK2 is a gene encoding a serine/threonine kinase involved in the initiation of autophagy, a cellular degradation pathway critical for maintaining tumor cell homeostasis. In NSCLC, altered ULK2 expression or activity has been associated with tumor progression and resistance to therapy, potentially impacting prognosis. Elevated or dysregulated ULK2 may influence patient survival by modulating cancer cell survival under stress, making it a candidate biomarker for disease aggressiveness and therapeutic response.",
  "TGFA": "TGFA (Transforming Growth Factor Alpha) is a gene encoding a ligand for the epidermal growth factor receptor (EGFR) involved in cell proliferation and survival pathways. In NSCLC, overexpression of TGFA has been associated with enhanced tumor growth and resistance to EGFR-targeted therapies, often correlating with poorer prognosis. Elevated TGFA levels may thus contribute to more aggressive disease and reduced patient survival outcomes.",
  "SSPN": "SSPN (Sarcospan) is a gene encoding a transmembrane protein involved in cell adhesion and signaling within the dystrophin-glycoprotein complex. In NSCLC, altered SSPN expression has been associated with tumor progression and metastasis, potentially impacting tumor invasiveness. Elevated or dysregulated SSPN may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to conventional therapies.",
  "LAIR1": "LAIR1 (Leukocyte-Associated Immunoglobulin-like Receptor 1) is an immune inhibitory receptor expressed on various immune cells, modulating immune responses within the tumor microenvironment. In NSCLC, elevated LAIR1 expression has been associated with immune evasion mechanisms, potentially leading to poorer prognosis by dampening anti-tumor immunity. Consequently, LAIR1 may influence patient survival by contributing to tumor immune escape and resistance to immunotherapy.",
  "CD300A": "CD300A is a gene encoding an immunoregulatory receptor expressed on myeloid and lymphoid cells, involved in modulating immune responses within the tumor microenvironment. In NSCLC, elevated CD300A expression has been associated with immune evasion mechanisms and poorer prognosis, potentially by inhibiting effective anti-tumor immunity. Consequently, high CD300A levels may correlate with reduced patient survival and could serve as a biomarker for immunotherapy response or as a target for novel immune-modulating treatments.",
  "NEMF": "NEMF (Nuclear Export Mediator Factor) is a gene involved in protein quality control and ribosome-associated quality control pathways. In NSCLC, altered expression or mutations in NEMF have been associated with dysregulated cellular stress responses, potentially impacting tumor progression and resistance to therapy. Consequently, NEMF status may serve as a prognostic biomarker influencing patient survival by modulating tumor aggressiveness and treatment response.",
  "SLC9A1": "SLC9A1 encodes a sodium/hydrogen exchanger involved in regulating intracellular pH and cell volume, impacting tumor cell metabolism and microenvironment. In NSCLC, altered SLC9A1 expression has been associated with enhanced tumor aggressiveness and resistance to apoptosis, potentially leading to poorer prognosis. Its activity may influence patient survival by promoting cancer cell survival and metastatic potential, making it a candidate biomarker for disease progression and therapeutic targeting.",
  "NDUFAF3": "NDUFAF3 is a gene encoding a mitochondrial complex I assembly factor involved in oxidative phosphorylation. In NSCLC, altered expression or mutations in NDUFAF3 may impact tumor metabolism and mitochondrial function, potentially influencing tumor aggressiveness and response to therapy. Its dysregulation has been associated with poorer survival outcomes, suggesting it could serve as a prognostic biomarker or therapeutic target in NSCLC.",
  "MBD1": "MBD1 (Methyl-CpG Binding Domain Protein 1) is a gene involved in epigenetic regulation through binding methylated DNA and modulating gene expression. In NSCLC, altered MBD1 expression has been associated with tumor progression and poor prognosis, likely due to its role in silencing tumor suppressor genes. Consequently, high MBD1 activity may correlate with reduced patient survival by promoting aggressive tumor behavior and resistance to therapy.",
  "WFS1": "WFS1 is a gene encoding wolframin, a protein involved in endoplasmic reticulum stress regulation and cellular homeostasis. In NSCLC, altered WFS1 expression has been associated with tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Its dysregulation may influence patient survival by promoting tumor aggressiveness and impacting response to therapy.",
  "ZC3H15": "ZC3H15 is a gene encoding a zinc finger CCCH-type containing protein involved in RNA binding and regulation of gene expression. In NSCLC, elevated ZC3H15 expression has been associated with tumor progression and poorer prognosis, potentially by promoting cancer cell proliferation and resistance to apoptosis. Its overexpression may serve as a biomarker for aggressive disease and could influence patient survival by contributing to treatment resistance and reduced overall survival.",
  "ADAMTSL2": "ADAMTSL2 is a gene encoding a secreted glycoprotein involved in extracellular matrix organization. In NSCLC, altered expression of ADAMTSL2 has been associated with tumor progression and poor prognosis, potentially by modulating the tumor microenvironment and promoting invasive behavior. Its expression levels may serve as a prognostic biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "RFC5": "RFC5 is a gene encoding a subunit of the replication factor C complex, which is essential for DNA replication and repair. In NSCLC, elevated RFC5 expression has been associated with increased tumor proliferation and poorer prognosis, potentially due to enhanced DNA repair capacity that confers resistance to chemotherapy. Thus, high RFC5 levels may predict reduced survival and could serve as a biomarker for aggressive disease and treatment response.",
  "RARS1": "RARS1 encodes arginyl-tRNA synthetase, a gene involved in protein translation and cellular metabolism. In NSCLC, altered expression or mutations in RARS1 have been associated with tumor progression and may correlate with poorer prognosis by promoting cancer cell proliferation and resistance to therapy. Thus, RARS1 status could serve as a potential biomarker influencing patient survival outcomes and guiding targeted treatment strategies.",
  "L2HGDH": "L2HGDH is a gene encoding L-2-hydroxyglutarate dehydrogenase, an enzyme involved in cellular metabolism and the regulation of oncometabolite levels. In NSCLC, altered expression or mutation of L2HGDH can disrupt metabolic homeostasis, potentially promoting tumor progression and resistance to therapy. Consequently, L2HGDH status may serve as a prognostic biomarker, where its loss or dysfunction is associated with poorer survival outcomes.",
  "CHRDL1": "CHRDL1 is a gene encoding a secreted protein that antagonizes bone morphogenetic proteins (BMPs), involved in cellular differentiation and proliferation pathways. In NSCLC, reduced CHRDL1 expression has been associated with enhanced tumor aggressiveness and poorer prognosis, likely due to dysregulated BMP signaling promoting tumor growth and metastasis. Thus, CHRDL1 expression levels may serve as a prognostic biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "COLGALT1": "COLGALT1 is a gene encoding collagen beta(1-O)galactosyltransferase 1, involved in collagen biosynthesis and extracellular matrix remodeling. In NSCLC, altered COLGALT1 expression has been associated with tumor progression and poor prognosis, likely by promoting a pro-tumorigenic microenvironment. Elevated COLGALT1 levels may correlate with reduced patient survival, making it a potential biomarker for aggressive disease and a target for therapeutic intervention.",
  "CTBP2": "CTBP2 is a gene encoding C-terminal binding protein 2, a transcriptional co-repressor involved in regulating gene expression linked to cell proliferation and apoptosis. In NSCLC, elevated CTBP2 expression has been associated with tumor progression and poor prognosis, likely due to its role in promoting epithelial-mesenchymal transition and resistance to apoptosis. Consequently, high CTBP2 levels may correlate with reduced patient survival and could serve as a potential biomarker for aggressive disease and therapeutic targeting.",
  "SLC30A9": "SLC30A9 is a gene encoding a zinc transporter involved in cellular metal ion homeostasis and transcriptional regulation. In NSCLC, altered expression or mutations in SLC30A9 have been associated with tumor progression and may impact cellular stress responses, influencing tumor aggressiveness. Its dysregulation could serve as a prognostic biomarker, where aberrant SLC30A9 activity correlates with poorer survival outcomes by promoting cancer cell survival and resistance to therapy.",
  "FAM117A": "FAM117A is a gene implicated in cellular signaling pathways that may influence tumor behavior in non-small cell lung cancer (NSCLC). Emerging evidence suggests that altered expression of FAM117A is associated with tumor progression and could serve as a prognostic biomarker. Its dysregulation may impact patient survival by modulating cancer cell proliferation and response to therapy.",
  "GPR22": "GPR22 is a gene encoding a G protein-coupled receptor implicated in cellular signaling pathways. In NSCLC, altered expression or mutation of GPR22 has been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence tumor aggressiveness and patient survival, potentially guiding therapeutic decision-making.",
  "EXT1": "EXT1 is a gene encoding exostosin glycosyltransferase 1, involved in heparan sulfate biosynthesis, which modulates cell signaling and tumor microenvironment interactions. In NSCLC, altered EXT1 expression has been associated with tumor progression and metastasis, potentially impacting prognosis. Elevated EXT1 levels may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "GNG7": "GNG7 encodes the G protein subunit gamma 7, involved in intracellular signaling pathways that regulate cell proliferation and apoptosis. In NSCLC, reduced GNG7 expression has been associated with tumor progression and poorer prognosis, suggesting its potential role as a tumor suppressor. Consequently, lower GNG7 levels may correlate with decreased patient survival, highlighting its value as a prognostic biomarker.",
  "SEPTIN9": "SEPTIN9 is a gene encoding a member of the septin family of GTP-binding proteins involved in cytoskeletal organization and cell division. In NSCLC, aberrant SEPTIN9 expression or methylation has been associated with tumor progression and poor prognosis, potentially serving as a biomarker for aggressive disease. Its dysregulation may influence patient survival by promoting cancer cell proliferation and resistance to apoptosis, thereby impacting treatment response and overall outcomes.",
  "ETV5": "ETV5 is a transcription factor gene involved in the ETS family, playing a role in cell proliferation and differentiation pathways. In NSCLC, elevated ETV5 expression has been associated with tumor progression and poor prognosis, potentially promoting metastasis and resistance to therapy. Consequently, high ETV5 levels may correlate with reduced overall survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "LTBP1": "LTBP1 (Latent Transforming Growth Factor Beta Binding Protein 1) is a gene involved in the regulation of TGF-β signaling, a pathway critical for tumor microenvironment modulation and fibrosis. In NSCLC, altered LTBP1 expression has been associated with tumor progression and poor prognosis, likely due to its role in promoting extracellular matrix remodeling and facilitating cancer cell invasion. Elevated LTBP1 levels may therefore correlate with reduced patient survival by enhancing tumor aggressiveness and resistance to therapy.",
  "LINC00312": "LINC00312 is a long non-coding RNA (lncRNA) implicated in the regulation of gene expression in non-small cell lung cancer (NSCLC). It has been associated with tumor suppression, where higher expression levels correlate with reduced tumor proliferation and metastasis. Clinically, elevated LINC00312 expression is linked to improved patient survival outcomes, suggesting its potential as a prognostic biomarker and therapeutic target in NSCLC.",
  "GAS7": "GAS7 (Growth Arrest-Specific 7) is a gene involved in cytoskeletal organization and neuronal development, recently implicated in tumor suppression mechanisms. In NSCLC, reduced GAS7 expression has been associated with enhanced tumor cell migration and poorer prognosis, suggesting its potential role as a prognostic biomarker. Lower GAS7 levels may correlate with decreased overall survival by promoting more aggressive tumor behavior and resistance to conventional therapies.",
  "TRIM9": "TRIM9 is a gene encoding a member of the tripartite motif-containing protein family involved in ubiquitination and protein regulation. In NSCLC, altered TRIM9 expression has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role in modulating cellular pathways linked to proliferation and apoptosis suggests it could influence treatment response and disease aggressiveness.",
  "ETV4": "ETV4 is a gene encoding a transcription factor involved in the ETS family, which regulates cell proliferation and metastasis pathways. In NSCLC, overexpression of ETV4 has been associated with enhanced tumor aggressiveness and poorer prognosis, likely due to its role in promoting invasion and resistance to apoptosis. Consequently, elevated ETV4 expression may correlate with reduced overall survival and could serve as a potential biomarker for risk stratification and targeted therapy development.",
  "SMPD3": "SMPD3 encodes sphingomyelin phosphodiesterase 3, an enzyme involved in sphingolipid metabolism that regulates cell apoptosis and proliferation. In NSCLC, altered SMPD3 expression has been associated with tumor progression and resistance to therapy, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by modulating tumor cell survival and response to treatment.",
  "SATB2": "SATB2 is a gene encoding a transcription factor involved in chromatin remodeling and gene regulation. In NSCLC, altered SATB2 expression has been associated with tumor progression and poorer prognosis, potentially by promoting metastatic behavior. Its expression level may serve as a prognostic biomarker, where higher SATB2 correlates with reduced overall survival and could inform risk stratification and therapeutic decisions.",
  "SCN11A": "SCN11A encodes a voltage-gated sodium channel subunit primarily involved in neuronal excitability but has emerging relevance in cancer biology. In NSCLC, alterations or expression changes in SCN11A may influence tumor cell invasiveness and metastatic potential, potentially serving as a biomarker for aggressive disease. Its dysregulation could correlate with poorer survival outcomes by promoting tumor progression and resistance to conventional therapies.",
  "NDUFA10": "NDUFA10 is a gene encoding a subunit of mitochondrial complex I involved in oxidative phosphorylation. In NSCLC, altered expression of NDUFA10 has been associated with disrupted mitochondrial function and metabolic reprogramming, which may contribute to tumor progression and resistance to therapy. Its dysregulation can influence patient survival by affecting cancer cell energy metabolism and apoptotic pathways, potentially serving as a prognostic biomarker or therapeutic target.",
  "NCOA2": "NCOA2 (Nuclear Receptor Coactivator 2) is a gene encoding a transcriptional coactivator involved in hormone receptor signaling pathways. In NSCLC, alterations or overexpression of NCOA2 have been associated with tumor progression and resistance to certain therapies, potentially serving as a biomarker for aggressive disease. Its dysregulation may contribute to poorer survival outcomes by promoting cancer cell proliferation and metastasis.",
  "CDKN1C": "CDKN1C is a tumor suppressor gene encoding the cyclin-dependent kinase inhibitor p57^KIP2, which regulates cell cycle progression. In NSCLC, reduced expression or loss of CDKN1C is associated with increased tumor proliferation and poorer prognosis. Its dysregulation may contribute to aggressive tumor behavior, thereby negatively impacting patient survival outcomes.",
  "TBC1D5": "TBC1D5 is a gene encoding a Rab GTPase-activating protein involved in endosomal trafficking and autophagy regulation. In NSCLC, altered expression of TBC1D5 has been associated with tumor progression and resistance to therapy, potentially impacting cellular metabolism and immune evasion. Its dysregulation may correlate with poorer survival outcomes by promoting aggressive tumor behavior and reduced treatment responsiveness.",
  "STX5": "STX5 (Syntaxin 5) is a gene encoding a SNARE protein involved in intracellular vesicle trafficking and membrane fusion. In NSCLC, altered STX5 expression has been associated with tumor progression and metastasis, potentially impacting cellular communication and tumor microenvironment. Elevated or dysregulated STX5 may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "XYLT2": "XYLT2 is a gene encoding xylosyltransferase 2, an enzyme involved in glycosaminoglycan biosynthesis critical for extracellular matrix remodeling. In NSCLC, altered XYLT2 expression has been associated with tumor progression and metastasis, potentially impacting tumor microenvironment and immune evasion. Elevated or dysregulated XYLT2 may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "TAF2": "TAF2 is a gene encoding a subunit of the transcription factor IID complex, involved in the initiation of gene transcription. In NSCLC, alterations or dysregulation of TAF2 may impact tumor cell proliferation and gene expression profiles, potentially influencing tumor aggressiveness. Although not yet a standard prognostic marker, aberrant TAF2 expression could be associated with poorer survival outcomes by promoting oncogenic transcriptional programs.",
  "FOSL2": "FOSL2 is a gene encoding a component of the AP-1 transcription factor complex involved in regulating cell proliferation and differentiation. In NSCLC, elevated FOSL2 expression has been associated with tumor progression and poorer prognosis, likely due to its role in promoting epithelial-mesenchymal transition and metastasis. Consequently, high FOSL2 levels may correlate with reduced patient survival and could serve as a potential biomarker for aggressive disease and therapeutic targeting.",
  "TUBAL3": "TUBAL3 is a gene encoding a tubulin alpha-like protein involved in microtubule dynamics and cellular structure. In NSCLC, altered expression of TUBAL3 has been associated with tumor progression and chemoresistance, potentially impacting cell division and migration. Elevated TUBAL3 levels may correlate with poorer survival outcomes by promoting aggressive tumor behavior and reduced treatment efficacy.",
  "MYO3A": "MYO3A is a gene encoding an unconventional myosin protein involved in actin-based cellular transport. Although not traditionally linked to NSCLC pathogenesis, emerging genomic analyses suggest that alterations or expression changes in MYO3A may correlate with tumor cell motility and metastatic potential, potentially impacting patient prognosis. Its role as a biomarker in NSCLC survival remains investigational but could influence outcomes by reflecting aggressive tumor behavior.",
  "GMFB": "GMFB (Glia Maturation Factor Beta) is a gene involved in neurodevelopmental processes and cellular differentiation. In the context of NSCLC, altered GMFB expression has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role suggests potential involvement in tumor microenvironment modulation, influencing disease aggressiveness and patient prognosis.",
  "HINFP": "HINFP is a gene encoding a transcription factor involved in the regulation of histone gene expression and cell cycle progression. In NSCLC, altered HINFP expression has been associated with tumor proliferation and may correlate with poorer prognosis by promoting aggressive tumor behavior. Its dysregulation could influence patient survival by enhancing cancer cell growth and resistance to therapy.",
  "ZNF302": "ZNF302 is a gene encoding a zinc finger protein involved in transcriptional regulation. In the context of NSCLC, altered expression or mutations in ZNF302 have been associated with tumor progression and poor prognosis. Its dysregulation may influence patient survival by affecting pathways related to cell proliferation and apoptosis, making it a potential biomarker for risk stratification and therapeutic targeting.",
  "KDSR": "KDSR (3-Ketodihydrosphingosine Reductase) is a gene involved in sphingolipid metabolism, critical for cell membrane integrity and signaling. In NSCLC, altered KDSR expression or mutation may impact tumor cell survival and resistance to apoptosis, potentially influencing disease progression. Its dysregulation could serve as a prognostic biomarker, where higher activity might correlate with poorer survival outcomes due to enhanced tumor aggressiveness or therapy resistance.",
  "SCN7A": "SCN7A encodes a voltage-gated sodium channel subunit implicated in cellular ion transport and electrical signaling. In NSCLC, alterations or differential expression of SCN7A have been associated with tumor progression and may influence tumor cell invasiveness. Its dysregulation could serve as a prognostic biomarker, where aberrant SCN7A activity potentially correlates with poorer survival outcomes by promoting aggressive tumor behavior.",
  "URGCP": "URGCP (Upregulator of Cell Proliferation) is a gene implicated in promoting tumor cell growth and survival. In NSCLC, elevated URGCP expression has been associated with aggressive tumor behavior and poorer prognosis, likely due to its role in enhancing proliferation and resistance to apoptosis. Consequently, high URGCP levels may predict reduced overall survival and could serve as a potential biomarker for risk stratification and targeted therapeutic development.",
  "CTNND1": "CTNND1 encodes p120-catenin, a key component of the cadherin-catenin complex involved in cell-cell adhesion and signaling. In NSCLC, altered CTNND1 expression or mutations can disrupt tumor suppressor functions, promoting invasion and metastasis, which are associated with poorer prognosis. Consequently, CTNND1 status may serve as a biomarker for aggressive disease and influence survival outcomes by modulating tumor progression.",
  "KLHL2": "KLHL2 is a gene encoding a substrate adaptor protein involved in ubiquitin-mediated protein degradation, impacting cellular signaling pathways. In NSCLC, altered KLHL2 expression has been associated with tumor progression and may influence response to targeted therapies. Its dysregulation can affect tumor cell proliferation and survival, thereby potentially serving as a prognostic biomarker linked to poorer patient outcomes.",
  "APAF1": "APAF1 (Apoptotic Protease Activating Factor 1) is a key gene involved in the intrinsic apoptosis pathway, mediating caspase activation and programmed cell death. In NSCLC, reduced APAF1 expression or functional impairment is associated with resistance to apoptosis, contributing to tumor progression and poorer prognosis. Consequently, APAF1 status may influence patient survival by affecting tumor sensitivity to chemotherapy and targeted therapies that rely on apoptosis induction.",
  "AVPR1A": "AVPR1A encodes the arginine vasopressin receptor 1A, a G-protein coupled receptor involved in vasoconstriction and cellular signaling pathways. In NSCLC, altered AVPR1A expression has been associated with tumor progression and may influence the tumor microenvironment, potentially impacting response to therapy. Its dysregulation could serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes due to enhanced tumor aggressiveness.",
  "TXLNGY": "TXLNGY is a gene that encodes a protein involved in intracellular transport and vesicle trafficking. Although not extensively characterized in NSCLC, emerging evidence suggests that altered expression of TXLNGY may impact tumor cell proliferation and metastatic potential. Its dysregulation could therefore influence patient survival by modulating tumor aggressiveness and response to therapy.",
  "ITGBL1": "ITGBL1 is a gene encoding an integrin beta-like protein involved in extracellular matrix interactions and cell adhesion. In NSCLC, elevated ITGBL1 expression has been associated with tumor progression, metastasis, and poorer prognosis, potentially by promoting invasive behavior. Consequently, high ITGBL1 levels may correlate with reduced overall survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "SLC52A1": "SLC52A1 is a gene encoding a riboflavin transporter involved in cellular vitamin B2 uptake, essential for metabolic processes. In NSCLC, altered expression of SLC52A1 has been associated with tumor metabolism dysregulation, potentially impacting cancer cell proliferation and resistance to therapy. Its expression levels may serve as a prognostic biomarker, where dysregulation correlates with poorer survival outcomes due to enhanced tumor aggressiveness or metabolic adaptation.",
  "YWHAH": "YWHAH encodes the 14-3-3 eta protein, a member of the 14-3-3 family involved in signal transduction and cell cycle regulation. In NSCLC, altered expression of YWHAH has been associated with tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and impacting response to targeted therapies.",
  "ACAP1": "ACAP1 is a gene encoding a GTPase-activating protein involved in endocytic recycling and membrane trafficking. In NSCLC, altered ACAP1 expression has been associated with tumor progression and immune microenvironment modulation, potentially impacting response to immunotherapy. Elevated ACAP1 levels may correlate with improved survival by enhancing anti-tumor immune activity, making it a candidate prognostic biomarker and therapeutic target.",
  "LRRC31": "LRRC31 is a gene encoding a leucine-rich repeat-containing protein implicated in cellular signaling pathways. In the context of NSCLC, altered expression or mutation of LRRC31 has been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence patient survival by affecting tumor aggressiveness and response to targeted therapies.",
  "DOK4": "DOK4 is a gene encoding an adaptor protein involved in intracellular signaling pathways that regulate cell proliferation and migration. In NSCLC, altered DOK4 expression has been associated with tumor progression and poor prognosis, potentially by promoting oncogenic signaling cascades. Its dysregulation may contribute to reduced patient survival by enhancing tumor aggressiveness and resistance to therapy.",
  "SIGLEC6": "SIGLEC6 is a gene encoding a sialic acid-binding immunoglobulin-like lectin involved in immune regulation. In NSCLC, elevated SIGLEC6 expression has been associated with an immunosuppressive tumor microenvironment, potentially contributing to tumor immune evasion. This immunomodulatory role may correlate with poorer patient survival by diminishing anti-tumor immune responses and impacting the efficacy of immunotherapies.",
  "BUB1": "BUB1 is a gene encoding a key mitotic checkpoint kinase involved in chromosome segregation during cell division. In NSCLC, overexpression or dysregulation of BUB1 has been associated with increased tumor proliferation and poor prognosis, potentially contributing to chemoresistance. Elevated BUB1 levels may therefore serve as a biomarker for aggressive disease and worse survival outcomes in NSCLC patients.",
  "DMXL2": "DMXL2 is a gene encoding a protein involved in intracellular vesicle trafficking and Notch signaling regulation. In NSCLC, altered expression or mutations in DMXL2 have been associated with tumor progression and resistance to targeted therapies, potentially impacting disease aggressiveness. Its dysregulation may correlate with poorer survival outcomes by promoting cancer cell survival and therapy evasion.",
  "NYNRIN": "NYNRIN is a gene that encodes an RNA-binding protein involved in post-transcriptional regulation. In the context of NSCLC, altered expression or mutations in NYNRIN have been associated with tumor progression and poorer prognosis, potentially by affecting pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting resistance to standard therapies.",
  "OSBPL8": "OSBPL8 is a gene encoding a member of the oxysterol-binding protein family involved in lipid transport and cellular signaling. In NSCLC, altered expression of OSBPL8 has been associated with tumor progression and may correlate with poorer prognosis by influencing cancer cell metabolism and survival pathways. Its dysregulation could serve as a potential biomarker for patient stratification and targeted therapeutic approaches impacting overall survival.",
  "PDE10A": "PDE10A is a gene encoding phosphodiesterase 10A, an enzyme involved in cyclic nucleotide signaling pathways that regulate cell proliferation and apoptosis. In NSCLC, altered PDE10A expression has been associated with tumor progression and may impact responsiveness to targeted therapies. Elevated PDE10A activity could contribute to poorer survival outcomes by promoting tumor growth and resistance mechanisms.",
  "Stage_II": "\"Stage_II\" is a clinical variable representing the tumor stage in non-small cell lung cancer (NSCLC) according to the TNM classification, indicating locally advanced disease with involvement of nearby lymph nodes but no distant metastasis. It is a critical prognostic factor, as patients diagnosed at Stage II generally have a lower survival rate compared to Stage I, often necessitating multimodal treatment including surgery and adjuvant chemotherapy. Accurate staging at this level guides therapeutic decisions and helps predict patient outcomes by reflecting tumor burden and potential for recurrence.",
  "PACSIN2": "PACSIN2 is a gene encoding a protein involved in membrane trafficking and cytoskeletal organization. In NSCLC, altered expression of PACSIN2 has been associated with tumor progression and metastasis, potentially impacting cellular motility. Its dysregulation may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "TPM3": "TPM3 encodes Tropomyosin 3, a cytoskeletal protein involved in actin filament stabilization and cellular motility. In NSCLC, aberrant TPM3 expression or gene fusions have been linked to tumor progression and metastasis, potentially serving as a biomarker for aggressive disease. Elevated TPM3 activity may correlate with poorer survival outcomes by promoting invasive tumor behavior and resistance to conventional therapies.",
  "GRAMD1B": "GRAMD1B is a gene involved in cholesterol transport and cellular lipid homeostasis. In the context of NSCLC, altered expression of GRAMD1B has been associated with tumor progression and may correlate with poorer prognosis. Its dysregulation could influence tumor cell metabolism and survival, thereby impacting patient outcomes and potentially serving as a biomarker for risk stratification.",
  "TDO2": "TDO2 encodes tryptophan 2,3-dioxygenase, an enzyme involved in the kynurenine pathway of tryptophan metabolism, which modulates immune suppression in the tumor microenvironment. In NSCLC, elevated TDO2 expression is associated with immune evasion and poorer prognosis, potentially reducing the efficacy of immunotherapies. Thus, high TDO2 levels may correlate with decreased patient survival by promoting tumor progression and resistance to immune checkpoint inhibitors.",
  "MOB4": "MOB4 is a gene encoding a member of the MOB family of proteins involved in cell cycle regulation and Hippo signaling pathway modulation. In NSCLC, altered MOB4 expression has been associated with tumor progression and poor prognosis, potentially by promoting cell proliferation and inhibiting apoptosis. Consequently, MOB4 status may serve as a prognostic biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "ECHDC1": "ECHDC1 is a gene encoding ethylmalonyl-CoA decarboxylase, involved in mitochondrial fatty acid metabolism. In NSCLC, altered expression or mutations in ECHDC1 have been associated with metabolic reprogramming that may affect tumor growth and resistance to therapy. Its dysregulation could serve as a prognostic biomarker, potentially correlating with poorer survival outcomes due to enhanced tumor aggressiveness and treatment resistance.",
  "PLAC8": "PLAC8 is a gene encoding a cysteine-rich protein involved in cellular differentiation and immune regulation. In NSCLC, elevated PLAC8 expression has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and resistance to apoptosis. Consequently, high PLAC8 levels may correlate with reduced patient survival and could serve as a prognostic biomarker or therapeutic target.",
  "HOXA10": "HOXA10 is a gene encoding a homeobox transcription factor involved in regulating gene expression during development and cellular differentiation. In NSCLC, aberrant expression of HOXA10 has been associated with tumor progression, metastasis, and poor prognosis, potentially by promoting epithelial-mesenchymal transition and resistance to apoptosis. Elevated HOXA10 levels may therefore serve as a biomarker for aggressive disease and poorer survival outcomes, guiding risk stratification and therapeutic decision-making.",
  "B9D1": "B9D1 is a gene encoding a component of the basal body involved in ciliary function and intracellular transport. In the context of NSCLC, altered expression or mutations in B9D1 have been associated with tumor progression and may impact cellular signaling pathways relevant to cancer growth. Its dysregulation could influence patient survival by affecting tumor aggressiveness and response to targeted therapies, making it a potential prognostic biomarker.",
  "NBL1": "NBL1 is a gene encoding a protein that acts as a BMP (bone morphogenetic protein) antagonist, involved in regulating cell growth and differentiation. In NSCLC, altered expression of NBL1 has been associated with tumor progression and poor prognosis, potentially by modulating pathways linked to tumor invasiveness and resistance to apoptosis. Its expression levels may serve as a prognostic biomarker, where higher NBL1 activity correlates with reduced overall survival in NSCLC patients.",
  "C1orf115": "C1orf115 is a gene whose expression has been investigated in the context of non-small cell lung cancer (NSCLC) survival analysis. Although not extensively characterized, altered expression of C1orf115 may be associated with tumor progression or response to therapy, potentially serving as a prognostic biomarker. Its differential expression could influence patient survival by reflecting underlying molecular mechanisms that affect tumor aggressiveness or treatment sensitivity.",
  "ANKRD7": "ANKRD7 is a gene encoding ankyrin repeat domain-containing protein 7, involved in protein-protein interactions and cellular signaling. In the context of NSCLC, altered expression or mutations in ANKRD7 have been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence patient survival by affecting tumor aggressiveness and response to targeted therapies.",
  "HJURP": "HJURP (Holliday Junction Recognition Protein) is a gene involved in chromatin assembly and DNA repair, playing a critical role in maintaining genomic stability. In NSCLC, elevated HJURP expression has been associated with aggressive tumor behavior and poorer prognosis, likely due to its role in promoting tumor cell proliferation and resistance to DNA-damaging therapies. Consequently, high HJURP levels may predict reduced overall survival and could serve as a potential biomarker for risk stratification and therapeutic targeting.",
  "PSTPIP2": "PSTPIP2 is a gene encoding a cytoskeletal adaptor protein involved in immune regulation and inflammatory signaling. In the context of NSCLC, altered expression or mutation of PSTPIP2 may modulate tumor-associated inflammation and immune microenvironment, potentially impacting tumor progression and response to immunotherapy. Consequently, PSTPIP2 status could serve as a prognostic biomarker influencing patient survival outcomes by affecting tumor aggressiveness and treatment efficacy.",
  "ASIC3": "ASIC3 (Acid-Sensing Ion Channel 3) is a gene encoding a proton-gated ion channel involved in cellular responses to acidic microenvironments, which are common in tumors. In NSCLC, altered ASIC3 expression has been associated with tumor progression and metastasis, potentially impacting tumor invasiveness. Its expression levels may serve as a prognostic biomarker, where higher ASIC3 activity could correlate with poorer survival outcomes due to enhanced tumor aggressiveness.",
  "AGTR2": "AGTR2 encodes the angiotensin II receptor type 2, a gene involved in the renin-angiotensin system that modulates cell growth and apoptosis. In NSCLC, altered AGTR2 expression has been associated with tumor progression and may influence the tumor microenvironment, potentially impacting response to therapy. Its expression levels could serve as a prognostic biomarker, where higher AGTR2 activity might correlate with improved survival by promoting anti-proliferative signaling pathways.",
  "GLUL": "GLUL encodes glutamine synthetase, an enzyme involved in glutamine metabolism critical for tumor cell proliferation and survival. In NSCLC, elevated GLUL expression has been associated with enhanced tumor growth and resistance to metabolic stress, potentially correlating with poorer prognosis. Thus, GLUL may serve as a biomarker for aggressive disease and a target for therapies aimed at disrupting tumor metabolic pathways to improve patient survival.",
  "CCR3": "CCR3 is a gene encoding the C-C chemokine receptor type 3, involved in immune cell trafficking and inflammatory responses. In NSCLC, altered CCR3 expression has been associated with tumor microenvironment modulation and may influence tumor progression and metastasis. Elevated or dysregulated CCR3 activity can impact patient survival by affecting immune evasion and responsiveness to immunotherapy.",
  "UFL1": "UFL1 is a gene encoding an E3 ubiquitin ligase involved in the UFMylation pathway, which regulates protein stability and cellular stress responses. In NSCLC, altered UFL1 expression has been associated with tumor progression and chemoresistance, potentially serving as a prognostic biomarker. Elevated UFL1 activity may influence patient survival by promoting cancer cell survival and reducing treatment efficacy.",
  "LPP": "LPP (LIM domain-containing preferred partner) is a gene encoding a protein involved in cell adhesion and cytoskeletal organization. In NSCLC, altered LPP expression has been associated with tumor progression and metastasis, potentially serving as a biomarker for aggressive disease. Elevated or dysregulated LPP may correlate with poorer survival outcomes by promoting invasive tumor behavior and resistance to therapy.",
  "STIM1": "STIM1 is a gene encoding a key regulator of calcium influx involved in cellular signaling pathways. In NSCLC, elevated STIM1 expression has been associated with enhanced tumor proliferation, metastasis, and resistance to apoptosis, correlating with poorer patient prognosis. Consequently, high STIM1 levels may serve as a biomarker for aggressive disease and reduced overall survival, potentially guiding targeted therapeutic strategies.",
  "CSNK1E": "CSNK1E encodes Casein Kinase 1 Epsilon, a serine/threonine kinase involved in regulating circadian rhythms and Wnt signaling pathways. In NSCLC, aberrant CSNK1E expression or activity has been linked to tumor progression and resistance to targeted therapies, potentially serving as a prognostic biomarker. Elevated CSNK1E levels may correlate with poorer survival outcomes by promoting cancer cell proliferation and survival.",
  "B2M": "B2M (Beta-2-microglobulin) is a gene encoding a component of the major histocompatibility complex class I (MHC-I) involved in antigen presentation. In NSCLC, alterations or low expression of B2M can impair immune recognition, potentially leading to immune evasion and resistance to immunotherapy. Consequently, B2M status may influence patient survival by modulating tumor immune surveillance and response to checkpoint inhibitors.",
  "LY96": "LY96 encodes MD-2, a co-receptor that complexes with TLR4 to mediate innate immune responses and inflammation. In NSCLC, aberrant LY96 expression has been linked to tumor-promoting inflammation and immune evasion, potentially contributing to more aggressive disease and poorer prognosis. Elevated LY96 activity may thus influence survival by modulating the tumor microenvironment and impacting response to immunotherapy.",
  "C9orf40": "C9orf40 is a gene whose expression or mutation status has been investigated in NSCLC for its potential prognostic value. Although not widely characterized, emerging evidence suggests that alterations in C9orf40 may be associated with tumor progression or response to therapy, potentially impacting patient survival. Its role in NSCLC survival analysis could help identify subsets of patients with distinct clinical outcomes or therapeutic vulnerabilities.",
  "MS4A4A": "MS4A4A is a gene encoding a membrane-spanning protein involved in immune cell signaling, particularly within myeloid cells. In NSCLC, elevated MS4A4A expression has been associated with modulation of the tumor microenvironment and immune response, potentially impacting tumor progression. Its expression levels may serve as a prognostic biomarker, where higher MS4A4A correlates with altered survival outcomes by influencing anti-tumor immunity and response to immunotherapy.",
  "ADAM5": "ADAM5 is a gene belonging to the ADAM (a disintegrin and metalloprotease) family, involved in cell adhesion and proteolytic processing. Although less studied in NSCLC, dysregulation of ADAM family members has been linked to tumor progression and metastasis, suggesting that altered ADAM5 expression may contribute to aggressive tumor behavior. Consequently, ADAM5 could influence patient survival by promoting invasive phenotypes and resistance to therapy, making it a potential prognostic biomarker or therapeutic target in NSCLC.",
  "VGF": "VGF is a gene encoding a neurosecretory protein involved in neuronal signaling and energy metabolism. In NSCLC, altered VGF expression has been associated with tumor progression and resistance to therapy, potentially serving as a biomarker for aggressive disease. Elevated VGF levels may correlate with poorer survival outcomes by promoting cancer cell survival and metastasis.",
  "HMBOX1": "HMBOX1 is a gene encoding a homeobox-containing transcription factor involved in regulating gene expression and cellular differentiation. In NSCLC, altered HMBOX1 expression has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and immune evasion. Its expression levels may serve as a prognostic biomarker, where higher HMBOX1 correlates with reduced overall survival and could inform risk stratification and therapeutic decision-making.",
  "EFCC1": "EFCC1 is a gene implicated in cellular signaling pathways relevant to tumor progression in non-small cell lung cancer (NSCLC). Alterations or expression levels of EFCC1 have been associated with tumor aggressiveness and may serve as a prognostic biomarker, where higher expression often correlates with poorer survival outcomes. Its role in modulating cancer cell proliferation and metastasis suggests potential utility in stratifying patients for targeted therapies and predicting treatment response.",
  "ABCA11P": "ABCA11P is a pseudogene related to the ATP-binding cassette (ABC) transporter family, which is involved in cellular transport mechanisms. Although ABCA11P itself is not a functional gene, its expression or dysregulation may reflect underlying genomic alterations impacting drug resistance pathways in NSCLC. Emerging evidence suggests that aberrant expression patterns of ABC transporter-related pseudogenes like ABCA11P could serve as indirect biomarkers influencing patient survival by modulating chemotherapy response.",
  "KCNJ16": "KCNJ16 is a gene encoding an inward-rectifier potassium channel involved in maintaining cellular ion homeostasis. In NSCLC, altered expression of KCNJ16 has been associated with tumor progression and may influence cancer cell proliferation and apoptosis. Its dysregulation could serve as a prognostic biomarker, where lower expression correlates with poorer survival outcomes, potentially guiding therapeutic strategies.",
  "MYG1": "MYG1 (Melanocyte proliferating gene 1) is a nuclear-encoded mitochondrial protein involved in RNA processing and mitochondrial function. In NSCLC, altered MYG1 expression has been associated with tumor progression and may impact cellular metabolism, influencing tumor aggressiveness. Elevated MYG1 levels could correlate with poorer survival outcomes by promoting cancer cell proliferation and resistance to apoptosis.",
  "PRPF39": "PRPF39 is a gene involved in pre-mRNA splicing, a critical process for proper gene expression regulation. In the context of NSCLC, altered expression or mutations in PRPF39 may disrupt RNA processing, potentially contributing to tumor progression and resistance to therapy. Its dysregulation has been associated with poorer survival outcomes, making it a potential prognostic biomarker and therapeutic target in NSCLC.",
  "EIF4H": "EIF4H is a gene encoding a translation initiation factor involved in mRNA binding and protein synthesis regulation. In NSCLC, overexpression of EIF4H has been associated with enhanced tumor cell proliferation and resistance to apoptosis, contributing to more aggressive disease. Elevated EIF4H levels may correlate with poorer patient survival, making it a potential prognostic biomarker and therapeutic target in NSCLC management.",
  "RACK1": "RACK1 (Receptor for Activated C Kinase 1) is a scaffold protein gene involved in multiple signaling pathways regulating cell growth, migration, and survival. In NSCLC, elevated RACK1 expression has been associated with tumor progression, metastasis, and resistance to chemotherapy, correlating with poorer prognosis. Its dysregulation may promote aggressive tumor behavior, thereby negatively impacting patient survival outcomes.",
  "NDRG1": "NDRG1 (N-myc downstream-regulated gene 1) is a gene involved in cellular differentiation and stress response pathways. In NSCLC, elevated NDRG1 expression has been associated with tumor suppression and improved prognosis, potentially by inhibiting metastasis and enhancing chemosensitivity. Consequently, higher NDRG1 levels may correlate with better patient survival outcomes and could serve as a prognostic biomarker or therapeutic target.",
  "ACTR1A": "ACTR1A is a gene encoding a subunit of the dynactin complex involved in intracellular transport and cytoskeletal organization. In the context of NSCLC, altered expression or mutations in ACTR1A have been associated with tumor progression and may correlate with poorer prognosis. Its dysregulation can influence cancer cell motility and metastasis, thereby potentially impacting patient survival outcomes.",
  "BEX1": "BEX1 (Brain Expressed X-linked 1) is a gene involved in neuronal differentiation and apoptosis regulation. In the context of NSCLC, altered BEX1 expression has been associated with tumor progression and poor prognosis, potentially by modulating cell survival pathways. Its dysregulation may contribute to reduced overall survival, making it a candidate biomarker for risk stratification and therapeutic targeting.",
  "TUBGCP3": "TUBGCP3 is a gene encoding a component of the gamma-tubulin ring complex involved in microtubule nucleation and mitotic spindle formation. In NSCLC, altered expression of TUBGCP3 has been associated with tumor cell proliferation and may correlate with poorer prognosis due to enhanced tumor growth and genomic instability. Its dysregulation could influence patient survival by promoting aggressive tumor behavior and resistance to therapies targeting cell division.",
  "P4HA2": "P4HA2 is a gene encoding prolyl 4-hydroxylase subunit alpha 2, an enzyme involved in collagen synthesis and extracellular matrix remodeling. In NSCLC, elevated P4HA2 expression has been associated with tumor progression, increased invasiveness, and poorer prognosis, likely due to its role in promoting a pro-tumorigenic microenvironment. Consequently, high P4HA2 levels may correlate with reduced patient survival and could serve as a potential biomarker for aggressive disease and therapeutic targeting.",
  "ASPA": "ASPA is a gene encoding aspartoacylase, an enzyme involved in amino acid metabolism. In the context of NSCLC, altered ASPA expression has been associated with tumor progression and may influence metabolic reprogramming of cancer cells. Its dysregulation could impact patient survival by affecting tumor growth and response to targeted therapies, making it a potential prognostic biomarker.",
  "KCNJ15": "KCNJ15 encodes an inward-rectifier potassium channel involved in regulating cellular ion homeostasis and membrane potential. In NSCLC, altered expression of KCNJ15 has been associated with tumor progression and may influence cancer cell proliferation and apoptosis. Its dysregulation could serve as a prognostic biomarker, where aberrant KCNJ15 activity potentially correlates with poorer survival outcomes by promoting more aggressive tumor behavior.",
  "GPR25": "GPR25 is a gene encoding a G protein-coupled receptor, which is involved in cellular signaling pathways. In the context of NSCLC, altered expression or mutations in GPR25 have been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence tumor growth and metastasis, potentially impacting patient survival outcomes by modulating cancer cell behavior and response to therapy.",
  "ADH1C": "ADH1C encodes alcohol dehydrogenase 1C, an enzyme involved in alcohol metabolism and retinoid signaling pathways. In NSCLC, altered ADH1C expression has been associated with tumor progression and may reflect metabolic reprogramming influencing tumor aggressiveness. Its differential expression or mutation status can serve as a prognostic biomarker, potentially correlating with poorer survival outcomes by promoting cancer cell proliferation and resistance to therapy.",
  "TRIO": "TRIO is a gene encoding a guanine nucleotide exchange factor involved in cytoskeletal organization and cell migration. In NSCLC, aberrant TRIO expression or mutation has been associated with enhanced tumor invasiveness and metastasis, correlating with poorer prognosis. Its activity may influence patient survival by promoting aggressive tumor behavior and resistance to conventional therapies.",
  "NCOA6": "NCOA6 is a gene encoding a nuclear receptor coactivator involved in transcriptional regulation of hormone receptors and other transcription factors. In NSCLC, alterations or overexpression of NCOA6 have been associated with enhanced tumor proliferation and resistance to targeted therapies, potentially leading to poorer prognosis. Its activity may influence patient survival by modulating oncogenic signaling pathways that drive tumor progression and impact treatment response.",
  "FKTN": "FKTN (Fukutin) is a gene involved in glycosylation processes critical for cell membrane stability and signaling. In NSCLC, altered FKTN expression has been associated with tumor progression and may correlate with poorer prognosis by promoting cancer cell invasion and resistance to therapy. Thus, FKTN status could serve as a potential biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "DIO2": "DIO2 encodes the enzyme type II iodothyronine deiodinase, which activates thyroid hormone signaling by converting thyroxine (T4) to the active triiodothyronine (T3). In NSCLC, altered DIO2 expression has been associated with tumor progression and may influence cancer cell metabolism and proliferation. Its dysregulation could impact patient survival by modulating tumor aggressiveness and response to therapy, making it a potential prognostic biomarker.",
  "FST": "FST (Follistatin) is a gene encoding a glycoprotein that binds and neutralizes members of the TGF-β superfamily, such as activins, thereby modulating cell growth and differentiation. In NSCLC, altered FST expression has been associated with tumor progression and resistance to apoptosis, potentially contributing to more aggressive disease phenotypes. Elevated FST levels may correlate with poorer survival outcomes by promoting tumor proliferation and impairing response to therapy.",
  "PWWP3A": "PWWP3A is a gene encoding a protein involved in chromatin organization and epigenetic regulation. In NSCLC, alterations or expression changes in PWWP3A have been associated with tumor progression and may impact response to targeted therapies. Its dysregulation can influence patient survival by affecting tumor aggressiveness and treatment resistance, making it a potential prognostic biomarker.",
  "PSG6": "PSG6 is a gene encoding a member of the pregnancy-specific glycoprotein family, which is involved in immune modulation. Although primarily studied in reproductive biology, emerging evidence suggests aberrant expression of PSG6 may influence tumor immune evasion mechanisms in NSCLC. Its altered expression could impact patient survival by modulating the tumor microenvironment and affecting response to immunotherapy.",
  "ZCCHC4": "ZCCHC4 is a gene encoding a methyltransferase involved in RNA modification, which can influence gene expression regulation. In NSCLC, aberrant expression of ZCCHC4 has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and resistance to apoptosis. Elevated ZCCHC4 levels may therefore correlate with reduced patient survival, making it a candidate biomarker for aggressive disease and a potential therapeutic target.",
  "GAS6": "GAS6 is a gene encoding the growth arrest-specific 6 protein, a ligand for the TAM family of receptor tyrosine kinases involved in cell survival, proliferation, and immune regulation. In NSCLC, elevated GAS6 expression has been associated with tumor progression, resistance to apoptosis, and poorer prognosis. Its overexpression may contribute to reduced patient survival by promoting tumor aggressiveness and therapy resistance.",
  "DSTNP2": "DSTNP2 refers to a specific genetic alteration or mutation within the DST gene, which encodes dystonin, a cytoskeletal linker protein involved in cell adhesion and structural integrity. In the context of NSCLC survival analysis, DST mutations have been associated with tumor progression and metastatic potential, potentially impacting cellular motility and invasion. Alterations in DSTNP2 may correlate with poorer prognosis by promoting aggressive tumor behavior, thereby influencing reduced overall survival in affected patients.",
  "PDE11A": "PDE11A is a gene encoding phosphodiesterase 11A, an enzyme involved in cyclic nucleotide signaling pathways that regulate cell proliferation and apoptosis. In NSCLC, alterations or expression changes in PDE11A have been associated with tumor progression and may impact responsiveness to targeted therapies. Its dysregulation can influence patient survival by modulating tumor growth dynamics and treatment sensitivity.",
  "FCGR3B": "FCGR3B encodes a low-affinity Fc gamma receptor involved in immune complex clearance and modulation of immune responses. In NSCLC, altered FCGR3B expression or polymorphisms may impact tumor immune evasion and response to immunotherapy, influencing prognosis. Elevated or functional variants of FCGR3B have been associated with improved survival by enhancing antibody-dependent cellular cytotoxicity and anti-tumor immunity.",
  "ALDH4A1": "ALDH4A1 is a gene encoding an enzyme involved in proline metabolism and cellular redox balance. In NSCLC, altered expression of ALDH4A1 has been associated with tumor progression and chemoresistance, potentially impacting oxidative stress responses. Its dysregulation may influence patient survival by modulating tumor aggressiveness and response to therapy, making it a candidate biomarker for prognosis and treatment stratification.",
  "MLXIP": "MLXIP is a gene encoding a transcription factor involved in glucose metabolism and cellular energy homeostasis. In NSCLC, altered MLXIP expression has been associated with tumor progression and poor prognosis, potentially by promoting metabolic adaptation and cancer cell survival. Its expression levels may serve as a biomarker for aggressive disease and influence patient survival outcomes by impacting tumor growth and response to therapy.",
  "HNRNPA3": "HNRNPA3 is a gene encoding a heterogeneous nuclear ribonucleoprotein involved in RNA processing and regulation. In NSCLC, altered expression of HNRNPA3 has been associated with tumor progression and poor prognosis, potentially by affecting mRNA splicing and stability of oncogenic transcripts. Its dysregulation may contribute to aggressive tumor behavior, thereby negatively influencing patient survival outcomes.",
  "POLL": "POLL encodes DNA polymerase lambda, a key enzyme involved in base excision repair and DNA damage tolerance. In NSCLC, altered POLL expression or mutations may impact genomic stability and influence tumor response to DNA-damaging therapies. Consequently, POLL status can affect patient survival by modulating tumor progression and sensitivity to chemotherapy or radiotherapy.",
  "HHIPL2": "HHIPL2 is a gene encoding a protein involved in hedgehog signaling modulation, a pathway implicated in tumor growth and progression. In NSCLC, altered HHIPL2 expression has been associated with tumor aggressiveness and poorer prognosis, potentially serving as a biomarker for disease progression. Its dysregulation may influence patient survival by promoting cancer cell proliferation and resistance to conventional therapies.",
  "ULK4": "ULK4 is a gene involved in autophagy regulation and cellular homeostasis. In NSCLC, altered ULK4 expression or mutation has been associated with tumor progression and may impact response to targeted therapies. Its dysregulation can influence patient survival by modulating cancer cell survival mechanisms and treatment resistance.",
  "SLC16A1": "SLC16A1 is a gene encoding the monocarboxylate transporter 1 (MCT1), involved in lactate transport and cellular metabolism. In NSCLC, elevated SLC16A1 expression has been associated with enhanced tumor glycolysis and aggressive phenotypes, correlating with poorer prognosis. Its activity may influence tumor microenvironment acidity and resistance to therapy, thereby impacting patient survival outcomes.",
  "IL15": "IL15 is a cytokine gene involved in the activation and proliferation of natural killer (NK) and T cells, playing a key role in antitumor immune responses. In NSCLC, higher IL15 expression has been associated with enhanced immune infiltration and improved prognosis, potentially augmenting the efficacy of immunotherapies. Consequently, IL15 may serve as a biomarker for favorable survival outcomes and a target to boost antitumor immunity in NSCLC patients.",
  "NAP1L2": "NAP1L2 is a gene encoding a nucleosome assembly protein involved in chromatin remodeling and regulation of gene expression. In NSCLC, altered expression of NAP1L2 has been associated with tumor progression and poor prognosis, potentially by influencing cell proliferation and epigenetic modifications. Its dysregulation may serve as a biomarker for aggressive disease and could impact patient survival by promoting tumor growth and resistance to therapy.",
  "RAI2": "RAI2 is a gene involved in retinoic acid-induced differentiation and has been implicated in tumor suppression. In NSCLC, higher RAI2 expression is associated with better prognosis, likely due to its role in inhibiting tumor progression and metastasis. Consequently, RAI2 expression levels may serve as a prognostic biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "ECE1": "ECE1 (Endothelin Converting Enzyme 1) is a gene encoding an enzyme involved in the endothelin signaling pathway, which regulates vasoconstriction and cell proliferation. In NSCLC, altered ECE1 expression has been associated with tumor progression and poor prognosis, potentially by promoting a pro-tumorigenic microenvironment. Elevated ECE1 activity may correlate with reduced survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "SLCO2B1": "SLCO2B1 encodes a solute carrier organic anion transporter involved in the cellular uptake of various endogenous compounds and drugs. In NSCLC, altered SLCO2B1 expression has been associated with differential drug transport and metabolism, potentially impacting chemotherapy efficacy. Its expression levels may influence patient survival by modulating tumor response to systemic therapies and affecting tumor microenvironment interactions.",
  "CTSL": "CTSL (Cathepsin L) is a gene encoding a lysosomal cysteine protease involved in protein degradation and extracellular matrix remodeling. In NSCLC, elevated CTSL expression has been associated with increased tumor invasiveness, metastasis, and poorer prognosis. Its overactivity may promote cancer progression and resistance to therapy, thereby negatively impacting patient survival outcomes.",
  "EEF1G": "EEF1G is a gene encoding a subunit of the eukaryotic elongation factor-1 complex involved in protein synthesis. In NSCLC, elevated EEF1G expression has been associated with enhanced tumor cell proliferation and poor prognosis, potentially serving as a biomarker for aggressive disease. Its overexpression may contribute to reduced patient survival by promoting tumor growth and resistance to therapy.",
  "CPN1": "CPN1 encodes carboxypeptidase N subunit 1, a metalloprotease involved in regulating inflammatory peptides and the tumor microenvironment. In NSCLC, altered CPN1 expression has been associated with tumor progression and immune modulation, potentially impacting response to therapy. Elevated CPN1 levels may correlate with poorer survival outcomes by promoting a pro-tumorigenic microenvironment and resistance to treatment.",
  "AKAP17A": "AKAP17A is a gene encoding A-kinase anchoring protein 17A, involved in intracellular signaling pathways that regulate cell growth and apoptosis. In the context of NSCLC, altered expression or mutations in AKAP17A have been associated with tumor progression and poorer prognosis. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and resistance to standard therapies.",
  "WAC": "WAC is a gene involved in ubiquitin-mediated protein degradation and regulation of cell cycle progression. In NSCLC, alterations or dysregulation of WAC have been associated with tumor growth and resistance to apoptosis, potentially impacting tumor aggressiveness. Its expression or mutation status may serve as a prognostic biomarker, where aberrant WAC activity correlates with poorer survival outcomes by promoting cancer cell proliferation and therapy resistance.",
  "SNHG14": "SNHG14 is a long non-coding RNA (lncRNA) implicated in the regulation of gene expression and tumor progression in non-small cell lung cancer (NSCLC). Elevated SNHG14 expression has been associated with enhanced tumor proliferation, metastasis, and resistance to therapy, correlating with poorer overall survival in NSCLC patients. Its role as a potential prognostic biomarker may help identify high-risk patients and guide personalized treatment strategies.",
  "TBC1D2B": "TBC1D2B is a gene encoding a Rab GTPase-activating protein involved in intracellular vesicle trafficking. In NSCLC, altered expression of TBC1D2B has been associated with tumor progression and may impact cellular signaling pathways related to metastasis. Its dysregulation could serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes by promoting aggressive tumor behavior.",
  "TYRP1": "TYRP1 (Tyrosinase-Related Protein 1) is a gene involved in melanin biosynthesis and has been implicated in tumor progression and immune modulation. In NSCLC, elevated TYRP1 expression has been associated with poorer prognosis, potentially due to its role in promoting tumor cell survival and resistance to apoptosis. Consequently, TYRP1 may serve as a prognostic biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "MYO1D": "MYO1D is a gene encoding an unconventional myosin involved in intracellular transport and cytoskeletal dynamics. In NSCLC, altered MYO1D expression has been associated with tumor cell migration and invasion, potentially contributing to aggressive disease behavior. Its dysregulation may serve as a prognostic biomarker, where higher MYO1D activity correlates with poorer survival outcomes due to enhanced metastatic potential.",
  "CERS4": "CERS4 encodes ceramide synthase 4, an enzyme involved in sphingolipid metabolism that regulates ceramide levels influencing cell apoptosis and proliferation. In NSCLC, altered CERS4 expression has been associated with tumor progression and chemoresistance, potentially serving as a prognostic biomarker. Elevated or dysregulated CERS4 activity may impact patient survival by modulating tumor cell survival and response to therapy.",
  "GSTA2": "GSTA2 encodes Glutathione S-Transferase Alpha 2, an enzyme involved in detoxification pathways that metabolize carcinogens and chemotherapeutic agents. In NSCLC, altered GSTA2 expression has been associated with chemotherapy resistance and poorer prognosis, likely due to enhanced drug metabolism reducing treatment efficacy. Consequently, high GSTA2 activity may correlate with decreased survival by promoting tumor cell survival and therapy resistance.",
  "S100A11": "S100A11 is a gene encoding a calcium-binding protein involved in cell proliferation and motility. In NSCLC, overexpression of S100A11 has been associated with tumor progression and poor prognosis, potentially promoting metastasis and resistance to therapy. Elevated S100A11 levels may therefore correlate with reduced patient survival and serve as a biomarker for aggressive disease.",
  "PSMC6": "PSMC6 is a gene encoding a subunit of the 26S proteasome involved in protein degradation and regulation of cell cycle and apoptosis. In NSCLC, elevated PSMC6 expression has been associated with enhanced tumor proliferation and resistance to proteasome inhibitors, correlating with poorer prognosis. Its activity may influence patient survival by promoting tumor progression and impacting responsiveness to targeted therapies.",
  "HSF2BP": "HSF2BP is a gene encoding a protein involved in homologous recombination and DNA repair pathways. In the context of NSCLC, altered expression or mutations in HSF2BP may impact genomic stability, potentially influencing tumor progression and response to DNA-damaging therapies. Consequently, HSF2BP status could serve as a prognostic biomarker, where dysregulation is associated with poorer survival outcomes due to impaired DNA repair capacity.",
  "NDN": "NDN (Necdin) is a gene involved in cell cycle regulation and apoptosis. In NSCLC, altered NDN expression has been associated with tumor suppression, where reduced NDN levels may correlate with more aggressive disease and poorer prognosis. Consequently, NDN status could serve as a potential biomarker influencing patient survival outcomes by reflecting tumor growth dynamics and response to therapy.",
  "HIP1": "HIP1 (Huntingtin Interacting Protein 1) is a gene involved in endocytic trafficking and cytoskeletal regulation. In NSCLC, elevated HIP1 expression has been associated with enhanced tumor cell survival and resistance to apoptosis, correlating with poorer prognosis. Its overexpression may contribute to aggressive tumor behavior and reduced overall survival, making it a potential biomarker for risk stratification and therapeutic targeting.",
  "ASAP1": "ASAP1 is a gene encoding an Arf GTPase-activating protein involved in cytoskeletal remodeling and cell migration. In NSCLC, overexpression of ASAP1 has been associated with enhanced tumor invasiveness and metastasis, correlating with poorer prognosis. Its elevated activity may contribute to reduced patient survival by promoting aggressive tumor behavior and resistance to conventional therapies.",
  "CDCP1": "CDCP1 (CUB domain-containing protein 1) is a transmembrane glycoprotein involved in cell adhesion and migration, frequently overexpressed in non-small cell lung cancer (NSCLC). Its elevated expression is associated with enhanced tumor invasiveness and metastasis, correlating with poorer prognosis and reduced overall survival. Targeting CDCP1 may offer therapeutic potential by inhibiting tumor progression and improving patient outcomes.",
  "MATN3": "MATN3 encodes matrilin-3, an extracellular matrix protein involved in cartilage structure and cell-matrix interactions. In NSCLC, aberrant MATN3 expression has been associated with tumor progression and poor prognosis, potentially by promoting a pro-tumorigenic microenvironment. Elevated MATN3 levels may correlate with reduced overall survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "RPL26L1": "RPL26L1 is a gene encoding a ribosomal protein involved in protein synthesis and cellular growth regulation. In the context of NSCLC, altered expression of RPL26L1 has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression levels correlate with poorer survival outcomes. Its role suggests potential utility in stratifying patients for risk and tailoring therapeutic strategies.",
  "B3GALT2": "B3GALT2 is a gene encoding a beta-1,3-galactosyltransferase involved in glycosylation processes that can affect cell-cell interactions and signaling. In NSCLC, altered expression of B3GALT2 has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role in modulating tumor microenvironment and metastatic potential suggests it could influence patient prognosis and response to targeted therapies.",
  "CCR6": "CCR6 is a gene encoding a chemokine receptor involved in immune cell trafficking and tumor microenvironment modulation. In NSCLC, elevated CCR6 expression has been associated with enhanced tumor invasiveness and immune evasion, correlating with poorer prognosis. Its activity may influence patient survival by promoting metastatic potential and resistance to immunotherapy.",
  "KLHL36": "KLHL36 is a gene encoding a member of the Kelch-like family of proteins involved in ubiquitination and protein degradation pathways. Although its specific role in NSCLC is not fully elucidated, emerging evidence suggests that altered KLHL36 expression may impact tumor progression and patient prognosis by modulating cellular protein homeostasis. Consequently, KLHL36 expression levels could serve as a potential biomarker influencing survival outcomes in NSCLC patients.",
  "EGLN2": "EGLN2 is a gene encoding prolyl hydroxylase domain-containing protein 1 (PHD1), involved in cellular oxygen sensing through regulation of hypoxia-inducible factors (HIFs). In NSCLC, altered EGLN2 expression can modulate tumor hypoxia responses, impacting angiogenesis and metabolic adaptation, which are critical for tumor progression and resistance to therapy. Consequently, EGLN2 activity may influence patient survival by affecting tumor aggressiveness and responsiveness to hypoxia-targeted treatments.",
  "ZNF835": "ZNF835 is a gene encoding a zinc finger protein involved in transcriptional regulation. In NSCLC, altered expression or mutations in ZNF835 have been associated with tumor progression and poorer prognosis, potentially by affecting pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting resistance to standard therapies.",
  "NSUN3": "NSUN3 is a gene encoding an RNA methyltransferase involved in mitochondrial tRNA modification, impacting mitochondrial function and cellular metabolism. In NSCLC, altered NSUN3 expression has been associated with tumor progression and may influence prognosis by affecting cancer cell energy metabolism and resistance to therapy. Elevated or dysregulated NSUN3 levels could correlate with poorer survival outcomes, making it a potential biomarker for patient stratification and targeted treatment approaches.",
  "GNLY": "GNLY (Granulysin) is a gene encoding a cytolytic protein expressed by activated cytotoxic T cells and natural killer cells, involved in immune-mediated tumor cell killing. In NSCLC, higher GNLY expression is associated with enhanced anti-tumor immune response and improved patient prognosis, reflecting a more active tumor-infiltrating lymphocyte environment. Consequently, elevated GNLY levels may correlate with better survival outcomes and could serve as a biomarker for immunotherapy responsiveness.",
  "EGLN1": "EGLN1 encodes prolyl hydroxylase domain-containing protein 2 (PHD2), a key regulator of the hypoxia-inducible factor (HIF) pathway involved in cellular response to oxygen levels. In NSCLC, altered EGLN1 expression or activity can modulate tumor hypoxia and angiogenesis, impacting tumor aggressiveness and resistance to therapy. Consequently, EGLN1 status may influence patient survival by affecting tumor progression and responsiveness to hypoxia-targeted treatments.",
  "ZBTB39": "ZBTB39 is a gene encoding a zinc finger and BTB domain-containing protein involved in transcriptional regulation. In NSCLC, altered expression or mutation of ZBTB39 has been associated with tumor progression and poorer prognosis, potentially by influencing cell proliferation and apoptosis pathways. Its dysregulation may serve as a biomarker for aggressive disease and could impact patient survival by promoting resistance to standard therapies.",
  "HGSNAT": "HGSNAT is a gene encoding an enzyme involved in heparan sulfate biosynthesis, impacting cellular signaling pathways relevant to tumor progression. In NSCLC, altered HGSNAT expression or mutation may influence tumor microenvironment remodeling and metastatic potential, thereby affecting prognosis. Its dysregulation has been associated with poorer survival outcomes, suggesting potential as a biomarker for aggressive disease and a target for therapeutic intervention.",
  "VEGFA": "VEGFA is a gene encoding vascular endothelial growth factor A, a key regulator of angiogenesis involved in tumor blood vessel formation. In NSCLC, elevated VEGFA expression is often associated with increased tumor aggressiveness, resistance to therapy, and poorer prognosis. Targeting VEGFA-mediated pathways can improve survival outcomes by inhibiting tumor vascularization and progression.",
  "ZFP37": "ZFP37 is a gene encoding a zinc finger protein involved in transcriptional regulation. In NSCLC, altered expression of ZFP37 has been associated with tumor progression and poorer prognosis, potentially by influencing cell proliferation and differentiation pathways. Its dysregulation may serve as a biomarker for aggressive disease and could impact patient survival by promoting tumor growth and resistance to therapy.",
  "CEP131": "CEP131 is a gene encoding a centrosomal protein involved in centrosome function and ciliogenesis. In NSCLC, overexpression of CEP131 has been associated with enhanced tumor cell proliferation and metastasis, correlating with poorer prognosis. Elevated CEP131 levels may thus serve as a biomarker for aggressive disease and reduced overall survival in NSCLC patients.",
  "ANO10": "ANO10 is a gene encoding anoctamin 10, a member of the anoctamin family involved in calcium-activated chloride channel activity. Although its role in NSCLC is not fully established, emerging evidence suggests that altered ANO10 expression or mutation may impact tumor cell signaling and microenvironment interactions, potentially influencing disease progression. Consequently, ANO10 status could serve as a novel biomarker for prognosis, where dysregulation may correlate with poorer survival outcomes in NSCLC patients.",
  "LTBP3": "LTBP3 (Latent Transforming Growth Factor Beta Binding Protein 3) is a gene involved in the regulation of TGF-β signaling, a pathway critical for tumor microenvironment modulation and fibrosis. In NSCLC, altered LTBP3 expression has been associated with tumor progression and poor prognosis, potentially by promoting extracellular matrix remodeling and immune evasion. Consequently, high LTBP3 levels may correlate with reduced survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "PIAS4": "PIAS4 is a gene encoding a protein inhibitor of activated STAT4, involved in regulating transcription and DNA damage response pathways. In NSCLC, elevated PIAS4 expression has been associated with enhanced tumor cell proliferation and resistance to apoptosis, potentially contributing to poorer prognosis. Its activity may influence patient survival by modulating oncogenic signaling and impacting responsiveness to targeted therapies.",
  "NUAK2": "NUAK2 is a gene encoding a serine/threonine kinase involved in cellular stress response and metabolic regulation. In NSCLC, elevated NUAK2 expression has been associated with tumor progression and poorer prognosis, potentially by promoting cancer cell survival and metastasis. Its activity may influence patient survival outcomes by contributing to aggressive tumor behavior and resistance to therapy.",
  "CCDC121": "CCDC121 is a gene encoding a coiled-coil domain-containing protein, which has recently emerged as a potential biomarker in non-small cell lung cancer (NSCLC). Although its precise biological function in NSCLC remains under investigation, altered expression of CCDC121 has been associated with tumor progression and poorer prognosis. Elevated or dysregulated CCDC121 may influence patient survival by promoting aggressive tumor behavior or impacting response to targeted therapies.",
  "PLGRKT": "PLGRKT encodes the plasminogen receptor with a C-terminal lysine, involved in extracellular matrix remodeling and immune cell migration. In NSCLC, elevated PLGRKT expression has been associated with enhanced tumor invasiveness and a pro-tumorigenic microenvironment, potentially leading to poorer prognosis. Its activity may influence patient survival by promoting metastasis and modulating immune responses, making it a candidate biomarker for aggressive disease and a potential therapeutic target.",
  "TMSB10": "TMSB10 is a gene encoding thymosin beta-10, a protein involved in actin cytoskeleton organization and cell motility. In NSCLC, elevated TMSB10 expression has been associated with enhanced tumor invasiveness and poor prognosis, potentially promoting metastasis and resistance to therapy. Consequently, high TMSB10 levels may correlate with reduced overall survival, making it a candidate biomarker for aggressive disease and a potential therapeutic target.",
  "GOT1": "GOT1 (Glutamic-Oxaloacetic Transaminase 1) is a gene encoding a key enzyme involved in cellular metabolism, particularly in the malate-aspartate shuttle that supports redox balance and energy production. In NSCLC, altered GOT1 expression has been linked to tumor metabolic reprogramming, influencing cancer cell proliferation and resistance to oxidative stress. Elevated GOT1 activity may correlate with poorer survival outcomes by promoting tumor growth and therapy resistance, making it a potential prognostic biomarker and therapeutic target.",
  "LDHC": "LDHC encodes lactate dehydrogenase C, an isoenzyme involved in anaerobic glycolysis, often upregulated in cancer metabolism. In NSCLC, elevated LDHC expression has been associated with enhanced tumor aggressiveness and poor prognosis, likely due to its role in promoting metabolic adaptation and tumor progression. Consequently, high LDHC levels may correlate with reduced overall survival and could serve as a potential biomarker for risk stratification and therapeutic targeting.",
  "STXBP1": "STXBP1 is a gene encoding a protein involved in vesicle-mediated neurotransmitter release and intracellular trafficking. In the context of NSCLC, altered expression or mutations in STXBP1 have been associated with tumor progression and may impact cellular signaling pathways relevant to cancer cell survival. Its dysregulation could influence patient prognosis by affecting tumor aggressiveness and response to therapy, thereby serving as a potential biomarker for survival outcomes.",
  "FPGS": "FPGS (Folylpolyglutamate Synthase) is a gene encoding an enzyme critical for folate metabolism and intracellular retention of antifolate chemotherapeutics. In NSCLC, altered FPGS expression can affect tumor sensitivity to antifolate-based treatments like pemetrexed, influencing therapeutic efficacy. Consequently, FPGS levels may serve as a predictive biomarker for treatment response and overall patient survival outcomes.",
  "GLTP": "GLTP (Glycolipid Transfer Protein) is a gene involved in intracellular lipid transport and membrane dynamics. In NSCLC, altered GLTP expression has been associated with tumor progression and poor prognosis, potentially by affecting cancer cell proliferation and apoptosis. Elevated GLTP levels may correlate with reduced overall survival, making it a candidate biomarker for risk stratification and therapeutic targeting.",
  "CAVIN2": "CAVIN2 is a gene encoding a protein involved in caveolae formation and cellular signaling pathways. In NSCLC, altered expression of CAVIN2 has been associated with tumor progression and metastasis, serving as a potential prognostic biomarker. Reduced CAVIN2 expression often correlates with poorer survival outcomes, likely due to its role in modulating tumor cell invasiveness and response to therapy.",
  "ADGRL1": "ADGRL1 encodes an adhesion G protein-coupled receptor involved in cell signaling and adhesion processes. In NSCLC, altered expression or mutation of ADGRL1 has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and resistance to conventional therapies.",
  "ZNF280D": "ZNF280D is a gene encoding a zinc finger protein involved in transcriptional regulation. In NSCLC, altered expression or mutations in ZNF280D have been associated with tumor progression and poorer prognosis, potentially by affecting pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting resistance to standard therapies.",
  "SNX10": "SNX10 (Sorting Nexin 10) is a gene involved in endosomal trafficking and cellular homeostasis. In NSCLC, altered SNX10 expression has been associated with tumor progression and poor prognosis, potentially by affecting cancer cell proliferation and metastasis. Its dysregulation may serve as a prognostic biomarker, influencing patient survival outcomes by modulating tumor aggressiveness and response to therapy.",
  "CALML3": "CALML3 encodes calmodulin-like protein 3, a calcium-binding protein involved in intracellular signaling pathways. In NSCLC, altered CALML3 expression has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with improved survival outcomes. Its role in modulating calcium-dependent pathways suggests potential influence on tumor cell proliferation and apoptosis, impacting patient prognosis.",
  "MRTFB": "MRTFB (Myocardin Related Transcription Factor B) is a gene encoding a transcriptional coactivator involved in regulating cytoskeletal dynamics and cellular differentiation. In NSCLC, altered MRTFB expression has been associated with tumor progression and metastasis, potentially impacting tumor invasiveness. Its dysregulation may influence patient survival by modulating pathways linked to cancer cell migration and resistance to therapy, making it a candidate biomarker for prognosis and therapeutic targeting.",
  "TP53TG1": "TP53TG1 is a long non-coding RNA regulated by the tumor suppressor gene TP53, involved in cellular stress responses and apoptosis. In NSCLC, altered expression of TP53TG1 has been associated with tumor progression and resistance to therapy, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by modulating tumor cell proliferation and sensitivity to treatment.",
  "IL6ST": "IL6ST encodes the glycoprotein 130 (gp130), a key signal transducer in the IL-6 cytokine family pathway involved in inflammation and tumor progression. In NSCLC, elevated IL6ST expression has been associated with enhanced tumor growth and resistance to apoptosis, correlating with poorer prognosis. Its activity may influence patient survival by promoting a pro-tumorigenic microenvironment and impacting response to targeted therapies.",
  "ADTRP": "ADTRP (Androgen-Dependent TFPI-Regulating Protein) is a gene involved in regulating tissue factor pathway inhibitor activity, impacting coagulation and vascular biology. In NSCLC, altered ADTRP expression has been associated with tumor progression and may influence the tumor microenvironment, potentially affecting angiogenesis and metastasis. Its dysregulation could serve as a prognostic biomarker, where higher or lower expression levels correlate with differential patient survival outcomes, guiding risk stratification and therapeutic decisions.",
  "KLK6": "KLK6 (Kallikrein-related peptidase 6) is a gene encoding a serine protease involved in extracellular matrix remodeling and tumor progression. In NSCLC, elevated KLK6 expression has been associated with increased tumor invasiveness and poorer prognosis, potentially serving as a biomarker for aggressive disease. Its overexpression may contribute to reduced patient survival by promoting metastasis and resistance to conventional therapies.",
  "MAN2A2": "MAN2A2 encodes a mannosidase enzyme involved in N-glycan processing, impacting protein folding and cell signaling pathways. In NSCLC, altered MAN2A2 expression has been associated with tumor progression and may influence tumor cell adhesion and metastasis. Elevated or dysregulated MAN2A2 levels could correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "KXD1": "KXD1 is a gene involved in intracellular vesicle trafficking and protein sorting. In the context of NSCLC, altered expression or mutation of KXD1 has been associated with tumor progression and poorer prognosis, potentially by affecting cellular transport mechanisms critical for cancer cell survival. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival outcomes by promoting tumor growth and resistance to therapy.",
  "CDC42BPA": "CDC42BPA is a gene encoding a serine/threonine kinase involved in cytoskeletal organization and cell motility. In NSCLC, altered expression or mutation of CDC42BPA has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by promoting invasive behavior and resistance to therapy, thereby correlating with poorer clinical outcomes.",
  "NDUFA5": "NDUFA5 is a gene encoding a subunit of mitochondrial complex I involved in oxidative phosphorylation. In NSCLC, altered expression of NDUFA5 has been associated with disrupted mitochondrial function and metabolic reprogramming, which may contribute to tumor progression and resistance to therapy. Consequently, its expression levels can serve as a prognostic biomarker, where dysregulation often correlates with poorer survival outcomes.",
  "PDCD1LG2": "PDCD1LG2 encodes the immune checkpoint ligand PD-L2, which interacts with PD-1 to modulate T-cell activity within the tumor microenvironment. In NSCLC, elevated PDCD1LG2 expression is associated with immune evasion and may predict response to immune checkpoint inhibitors. Its expression levels can influence patient survival by impacting anti-tumor immune responses and therapeutic efficacy.",
  "PPARD": "PPARD (Peroxisome Proliferator-Activated Receptor Delta) is a nuclear receptor gene involved in regulating lipid metabolism, inflammation, and cell proliferation. In NSCLC, altered PPARD expression has been associated with tumor progression and resistance to apoptosis, potentially contributing to more aggressive disease phenotypes. Elevated PPARD activity may correlate with poorer survival outcomes by promoting tumor growth and metastasis, making it a potential prognostic biomarker and therapeutic target.",
  "CRTAM": "CRTAM (Class I–restricted T cell–associated molecule) is a gene encoding a cell surface receptor involved in immune cell adhesion and activation, particularly in cytotoxic T lymphocytes and natural killer cells. In NSCLC, higher CRTAM expression has been associated with enhanced anti-tumor immune responses and improved patient prognosis, likely reflecting a more active tumor immune microenvironment. Consequently, CRTAM may serve as a biomarker for favorable survival outcomes and potential responsiveness to immunotherapy.",
  "KIF1C": "KIF1C is a gene encoding a kinesin motor protein involved in intracellular transport and cytoskeletal dynamics. In NSCLC, altered expression or mutations in KIF1C have been associated with tumor progression and metastasis, potentially impacting cellular motility. Its dysregulation may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "EDNRB": "EDNRB (Endothelin Receptor Type B) is a gene encoding a G-protein coupled receptor involved in the endothelin signaling pathway, which regulates cell proliferation and vascular tone. In NSCLC, altered EDNRB expression or methylation status has been associated with tumor progression and poor prognosis, potentially by promoting tumor growth and metastasis. Consequently, EDNRB may serve as a prognostic biomarker influencing patient survival outcomes and could represent a target for therapeutic intervention.",
  "ACOT8": "ACOT8 is a gene encoding acyl-CoA thioesterase 8, involved in fatty acid metabolism and lipid homeostasis. In NSCLC, altered ACOT8 expression has been associated with tumor progression and metabolic reprogramming, potentially serving as a prognostic biomarker. Elevated or dysregulated ACOT8 may influence patient survival by promoting cancer cell proliferation and resistance to metabolic stress, impacting overall treatment outcomes.",
  "GAPDH": "GAPDH is a gene encoding glyceraldehyde-3-phosphate dehydrogenase, a key enzyme in glycolysis often used as a housekeeping control in molecular studies. In NSCLC, aberrant GAPDH expression has been linked to altered tumor metabolism and may correlate with aggressive tumor behavior and poor prognosis. Elevated GAPDH levels can reflect enhanced glycolytic activity, potentially contributing to tumor progression and reduced patient survival.",
  "OAZ2": "OAZ2 (Ornithine Decarboxylase Antizyme 2) is a gene involved in the regulation of polyamine metabolism, which influences cell proliferation and apoptosis. In NSCLC, altered OAZ2 expression has been associated with tumor progression and may serve as a prognostic biomarker, where reduced OAZ2 levels correlate with poorer survival outcomes. Its modulation could impact tumor growth dynamics, thereby influencing patient prognosis and potential therapeutic responses.",
  "NEBL": "NEBL (nebulette) is a gene encoding a cytoskeletal protein involved in cell adhesion and structural integrity. In NSCLC, altered NEBL expression has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Elevated NEBL levels may correlate with poorer survival outcomes by promoting invasive tumor behavior and resistance to therapy.",
  "LPAR4": "LPAR4 encodes a lysophosphatidic acid receptor involved in G-protein coupled receptor signaling pathways that regulate cell proliferation and migration. In NSCLC, altered LPAR4 expression has been associated with tumor progression and may contribute to a more aggressive phenotype. Its dysregulation can influence patient survival by promoting metastatic potential and resistance to therapy, making it a potential prognostic biomarker and therapeutic target.",
  "EPHB4": "EPHB4 is a gene encoding a receptor tyrosine kinase involved in angiogenesis and cell migration pathways. In NSCLC, overexpression of EPHB4 has been associated with tumor progression, metastasis, and poorer prognosis. Its activity may promote tumor vascularization and resistance to therapy, thereby negatively impacting patient survival outcomes.",
  "ZFR2": "ZFR2 is a gene encoding a zinc finger RNA-binding protein involved in RNA processing and regulation. In NSCLC, aberrant expression or mutation of ZFR2 has been associated with tumor progression and poor prognosis, potentially by affecting pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting resistance to standard therapies.",
  "SLC11A2": "SLC11A2 is a gene encoding a divalent metal transporter involved in cellular iron uptake and homeostasis. In NSCLC, altered expression of SLC11A2 has been associated with tumor progression and resistance to therapy, potentially by modulating iron metabolism and oxidative stress. Its dysregulation may influence patient survival by promoting tumor growth and impacting responsiveness to treatment.",
  "OLFM4": "OLFM4 (Olfactomedin 4) is a gene encoding a glycoprotein involved in cell adhesion and anti-apoptotic processes. In NSCLC, elevated OLFM4 expression has been associated with tumor progression and poorer prognosis, potentially by promoting cancer cell survival and resistance to apoptosis. Thus, OLFM4 may serve as a prognostic biomarker, where higher levels correlate with reduced overall survival and could inform risk stratification and therapeutic targeting.",
  "APBB1": "APBB1 is a gene encoding a protein involved in amyloid precursor protein binding and cellular signaling pathways related to apoptosis and DNA repair. In the context of NSCLC, altered expression or mutations in APBB1 have been associated with tumor progression and resistance to therapy, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by affecting tumor cell survival and response to treatment, thereby impacting overall prognosis.",
  "SLC16A3": "SLC16A3 encodes a monocarboxylate transporter involved in lactate efflux and cellular metabolism, playing a key role in tumor microenvironment acidification. In NSCLC, elevated SLC16A3 expression is associated with aggressive tumor behavior and poorer prognosis, likely due to enhanced metabolic adaptation and immune evasion. Its overexpression may predict reduced survival and could serve as a potential target for metabolic or immunomodulatory therapies.",
  "MMP8": "MMP8 encodes matrix metalloproteinase-8, an enzyme involved in extracellular matrix remodeling and inflammatory responses. In NSCLC, altered MMP8 expression has been associated with tumor invasion and metastasis, potentially serving as a prognostic biomarker. Elevated MMP8 levels may correlate with poorer survival outcomes by facilitating tumor progression and resistance to therapy.",
  "ARHGAP44": "ARHGAP44 is a gene encoding a Rho GTPase-activating protein involved in cytoskeletal regulation and cell migration. In NSCLC, altered expression or mutation of ARHGAP44 has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by promoting invasive tumor behavior and resistance to therapy.",
  "PAFAH1B1": "PAFAH1B1 is a gene encoding a regulatory subunit of platelet-activating factor acetylhydrolase, involved in intracellular signaling and cytoskeletal dynamics. In NSCLC, altered expression or mutation of PAFAH1B1 has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and resistance to therapy.",
  "KNL1": "KNL1 is a gene encoding a kinetochore scaffold protein essential for accurate chromosome segregation during mitosis. In NSCLC, aberrant expression or dysregulation of KNL1 has been associated with increased tumor proliferation and genomic instability, correlating with poorer prognosis. Its role in cell cycle regulation suggests that elevated KNL1 levels may contribute to aggressive tumor behavior and reduced patient survival.",
  "SLC35E3": "SLC35E3 is a gene encoding a nucleotide sugar transporter involved in glycosylation processes. In NSCLC, altered expression of SLC35E3 has been associated with tumor progression and poor prognosis, potentially by affecting cell surface glycoprotein composition and tumor microenvironment interactions. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and resistance to therapy.",
  "ELAVL3": "ELAVL3 is a gene encoding an RNA-binding protein involved in post-transcriptional regulation of mRNA stability and translation. In NSCLC, altered expression of ELAVL3 has been associated with tumor progression and may influence cancer cell survival and proliferation. Its dysregulation could serve as a prognostic biomarker, where higher ELAVL3 expression correlates with poorer patient survival outcomes due to enhanced tumor aggressiveness.",
  "NEIL3": "NEIL3 is a DNA glycosylase gene involved in base excision repair, playing a critical role in maintaining genomic stability. In NSCLC, elevated NEIL3 expression has been associated with increased tumor proliferation and resistance to DNA-damaging therapies, correlating with poorer patient prognosis. Thus, NEIL3 may serve as a potential biomarker for aggressive disease and a target for enhancing treatment response.",
  "STC2": "STC2 (Stanniocalcin 2) is a gene encoding a secreted glycoprotein involved in cellular calcium and phosphate homeostasis. In NSCLC, elevated STC2 expression has been associated with tumor progression, metastasis, and resistance to apoptosis, correlating with poorer overall survival. Its overexpression may serve as a prognostic biomarker indicating more aggressive disease and potentially guiding therapeutic strategies.",
  "PRSS8": "PRSS8 encodes a serine protease involved in epithelial integrity and tumor suppression. In NSCLC, reduced PRSS8 expression has been associated with increased tumor invasiveness and poorer prognosis. Its downregulation may contribute to aggressive disease behavior, thereby negatively impacting patient survival outcomes.",
  "AVL9": "AVL9 is a gene involved in intracellular vesicle trafficking and cell polarity regulation. In NSCLC, elevated AVL9 expression has been associated with enhanced tumor cell migration and invasion, correlating with poorer prognosis. Its overexpression may contribute to aggressive tumor behavior, thereby negatively impacting patient survival outcomes.",
  "GSTA4": "GSTA4 is a gene encoding Glutathione S-transferase A4, an enzyme involved in detoxification and oxidative stress response pathways. In NSCLC, altered GSTA4 expression has been associated with chemoresistance and tumor progression, potentially impacting treatment efficacy. Elevated GSTA4 levels may correlate with poorer survival outcomes by enhancing cancer cell survival under oxidative stress and reducing sensitivity to chemotherapy.",
  "ZNF205-AS1": "ZNF205-AS1 is a long non-coding RNA (lncRNA) implicated in the regulation of gene expression in non-small cell lung cancer (NSCLC). Emerging evidence suggests that altered expression of ZNF205-AS1 is associated with tumor progression and poor prognosis, potentially by modulating pathways involved in cell proliferation and metastasis. Its dysregulation may serve as a prognostic biomarker, influencing patient survival outcomes by promoting more aggressive tumor behavior.",
  "NFRKB": "NFRKB is a gene encoding a nuclear factor involved in chromatin remodeling and transcriptional regulation. In NSCLC, altered expression or mutation of NFRKB has been associated with tumor progression and poor prognosis, potentially by influencing DNA repair and cell cycle pathways. Its dysregulation may contribute to reduced survival by promoting aggressive tumor behavior and resistance to standard therapies.",
  "ADAM22": "ADAM22 is a gene encoding a member of the ADAM (a disintegrin and metalloprotease) family involved in cell adhesion and signaling. In NSCLC, altered expression of ADAM22 has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by promoting aggressive tumor behavior and resistance to conventional therapies.",
  "EP300": "EP300 is a gene encoding a histone acetyltransferase involved in chromatin remodeling and transcriptional regulation. In NSCLC, mutations or altered expression of EP300 can disrupt tumor suppressor pathways and are associated with aggressive tumor behavior and poorer prognosis. Its status may influence patient survival by affecting tumor growth, response to therapy, and metastatic potential.",
  "ZPBP": "ZPBP (Zona Pellucida Binding Protein) is a gene primarily involved in sperm-egg recognition but has emerging relevance in cancer genomics as a potential biomarker. In NSCLC, aberrant expression or mutation of ZPBP may reflect underlying tumor biology linked to cell adhesion or immune interactions, although its direct prognostic role remains under investigation. Alterations in ZPBP could influence patient survival by modulating tumor progression or response to therapy, warranting further study for clinical utility.",
  "HNRNPH3": "HNRNPH3 is a gene encoding a heterogeneous nuclear ribonucleoprotein involved in mRNA splicing and regulation. In NSCLC, altered expression or mutations in HNRNPH3 have been associated with dysregulated RNA processing, potentially contributing to tumor progression and resistance to therapy. Its aberrant activity may correlate with poorer survival outcomes by promoting aggressive tumor phenotypes and impacting response to treatment.",
  "SLC1A2": "SLC1A2 is a gene encoding a glutamate transporter involved in cellular amino acid metabolism and neurotransmitter regulation. In NSCLC, altered expression of SLC1A2 has been associated with tumor progression and may impact the tumor microenvironment by modulating metabolic pathways. Its dysregulation can influence patient survival by affecting cancer cell proliferation and resistance to therapy, making it a potential prognostic biomarker and therapeutic target.",
  "RNASEH1": "RNASEH1 is a gene encoding ribonuclease H1, an enzyme involved in the removal of RNA primers during DNA replication and maintenance of mitochondrial DNA integrity. In NSCLC, altered expression or mutations in RNASEH1 may impact genomic stability and mitochondrial function, potentially influencing tumor progression and response to therapy. Consequently, RNASEH1 status could serve as a biomarker for patient prognosis, where dysregulation may be associated with poorer survival outcomes.",
  "TH": "\"TH\" refers to the gene encoding tyrosine hydroxylase, an enzyme involved in catecholamine biosynthesis. While not a classical NSCLC driver, altered TH expression has been linked to tumor neuroendocrine differentiation and may correlate with more aggressive disease phenotypes. Elevated TH levels could thus serve as a biomarker for poorer prognosis and influence survival by promoting tumor progression or resistance to standard therapies.",
  "AKAP3": "AKAP3 is a gene encoding A-kinase anchoring protein 3, involved in intracellular signaling pathways that regulate cell growth and differentiation. In the context of NSCLC, aberrant expression of AKAP3 has been associated with tumor progression and poor prognosis, potentially by modulating pathways linked to cancer cell proliferation and metastasis. Its expression levels may serve as a prognostic biomarker, influencing patient survival outcomes by identifying more aggressive tumor phenotypes.",
  "GLRA3": "GLRA3 encodes the glycine receptor alpha 3 subunit, a gene involved in inhibitory neurotransmission but increasingly recognized for its role in tumor biology. In NSCLC, altered GLRA3 expression has been associated with tumor progression and poor prognosis, potentially by modulating cellular signaling pathways that affect proliferation and apoptosis. Its expression level may serve as a prognostic biomarker, where higher GLRA3 correlates with reduced overall survival, guiding risk stratification and therapeutic decision-making.",
  "MFAP2": "MFAP2 is a gene encoding microfibril-associated glycoprotein 2, involved in extracellular matrix organization and cell adhesion. In NSCLC, elevated MFAP2 expression has been associated with tumor progression and poorer prognosis, likely by promoting tumor invasion and metastasis. Thus, MFAP2 may serve as a prognostic biomarker, where higher levels correlate with reduced overall survival in NSCLC patients.",
  "BSG": "BSG (Basigin, also known as CD147) is a transmembrane glycoprotein involved in tumor progression and metastasis through regulation of matrix metalloproteinases and cell adhesion. In NSCLC, elevated BSG expression has been associated with aggressive tumor behavior and poorer prognosis, potentially serving as a biomarker for disease progression. Its overexpression may contribute to reduced patient survival by promoting invasion and resistance to conventional therapies.",
  "NOCT": "NOCT (Nocturnin) is a gene encoding a circadian deadenylase involved in post-transcriptional regulation of metabolic and inflammatory pathways. In NSCLC, altered NOCT expression has been associated with tumor progression and may impact cellular metabolism and immune response, influencing tumor aggressiveness. Consequently, NOCT expression levels could serve as a prognostic biomarker, where dysregulation may correlate with poorer survival outcomes and potentially guide therapeutic strategies targeting tumor metabolism.",
  "SOX2": "SOX2 is a transcription factor gene involved in maintaining stem cell pluripotency and regulating cell differentiation. In NSCLC, particularly squamous cell carcinoma, SOX2 amplification or overexpression is frequently observed and is associated with tumor proliferation and resistance to therapy. Elevated SOX2 levels have been linked to poorer survival outcomes, making it a potential prognostic biomarker and therapeutic target in NSCLC management.",
  "CTAGE9": "CTAGE9 is a gene implicated in the regulation of protein trafficking and has been identified as a cancer-testis antigen with restricted normal tissue expression but aberrant activation in various tumors, including NSCLC. Its expression in NSCLC has been associated with tumor progression and immune evasion, potentially serving as a biomarker for aggressive disease. Elevated CTAGE9 levels may correlate with poorer survival outcomes by promoting tumor growth and resistance to conventional therapies.",
  "BASP1": "BASP1 is a gene encoding a brain acid-soluble protein involved in transcriptional regulation and cellular differentiation. In NSCLC, altered BASP1 expression has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and metastasis. Its expression level may serve as a prognostic biomarker, where higher BASP1 correlates with reduced overall survival, guiding risk stratification and therapeutic decision-making.",
  "AGTR1": "AGTR1 encodes the angiotensin II type 1 receptor, a key component of the renin-angiotensin system involved in regulating blood pressure and cellular proliferation. In NSCLC, AGTR1 overexpression has been associated with enhanced tumor growth, angiogenesis, and metastasis, correlating with poorer prognosis. Targeting AGTR1 signaling may influence patient survival by modulating tumor progression and improving therapeutic response.",
  "PML": "PML (Promyelocytic Leukemia) is a tumor suppressor gene involved in regulating apoptosis, senescence, and DNA damage response. In NSCLC, altered PML expression or disruption of PML nuclear bodies has been associated with tumor progression and resistance to therapy. Its loss or downregulation may correlate with poorer survival outcomes by enabling cancer cell survival and treatment evasion.",
  "DAAM1": "DAAM1 is a gene encoding a formin protein involved in actin cytoskeleton remodeling and Wnt/planar cell polarity signaling. In NSCLC, elevated DAAM1 expression has been associated with enhanced tumor cell migration and invasion, correlating with poorer prognosis. Its activity may contribute to aggressive tumor behavior, thereby negatively impacting patient survival outcomes.",
  "SSRP1": "SSRP1 is a gene encoding a subunit of the FACT complex involved in chromatin remodeling and transcription regulation. In NSCLC, elevated SSRP1 expression has been associated with tumor progression and poor prognosis, likely due to its role in promoting cancer cell proliferation and resistance to apoptosis. Consequently, high SSRP1 levels may correlate with reduced overall survival, making it a potential biomarker for aggressive disease and a target for therapeutic intervention.",
  "RAP1GAP2": "RAP1GAP2 is a gene encoding a GTPase-activating protein involved in regulating RAP1 signaling pathways that influence cell adhesion and migration. In the context of NSCLC, altered expression or mutation of RAP1GAP2 may impact tumor invasiveness and metastatic potential, thereby serving as a potential prognostic biomarker. Its dysregulation could correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "SLC27A5": "SLC27A5 is a gene encoding a fatty acid transporter involved in lipid metabolism, which can influence tumor cell energy homeostasis in non-small cell lung cancer (NSCLC). Altered expression of SLC27A5 has been associated with tumor progression and may correlate with poorer prognosis by promoting cancer cell proliferation and resistance to therapy. Thus, SLC27A5 expression levels could serve as a potential biomarker for NSCLC survival outcomes and therapeutic targeting.",
  "HUNK": "HUNK (Hormonally Upregulated Neu-associated Kinase) is a serine/threonine kinase gene implicated in cancer cell survival and metastasis. In NSCLC, elevated HUNK expression has been associated with enhanced tumor aggressiveness and resistance to apoptosis, potentially contributing to poorer prognosis. Its activity may influence patient survival by promoting tumor progression and reducing responsiveness to conventional therapies.",
  "SLC2A5": "SLC2A5 encodes a fructose transporter involved in cellular glucose metabolism and energy supply. In NSCLC, overexpression of SLC2A5 has been associated with enhanced tumor growth and poor prognosis, likely due to increased metabolic flexibility supporting cancer cell survival. Its expression level may serve as a prognostic biomarker and potential therapeutic target influencing patient survival outcomes.",
  "ATP6V0A1": "ATP6V0A1 encodes a subunit of the vacuolar ATPase (V-ATPase) complex involved in intracellular acidification and vesicle trafficking. In NSCLC, dysregulation of ATP6V0A1 has been linked to altered tumor metabolism and microenvironment acidity, which can promote cancer progression and resistance to therapy. Elevated expression or mutation of ATP6V0A1 may correlate with poorer survival outcomes by facilitating tumor invasiveness and reducing treatment efficacy.",
  "GCH1": "GCH1 encodes GTP cyclohydrolase 1, a key enzyme in the biosynthesis of tetrahydrobiopterin, which influences nitric oxide production and cellular metabolism. In NSCLC, altered GCH1 expression has been associated with tumor progression and resistance to therapy, potentially impacting tumor microenvironment and immune response. Elevated GCH1 activity may correlate with poorer survival outcomes by promoting tumor growth and reducing treatment efficacy.",
  "SIGLEC9": "SIGLEC9 is a gene encoding a sialic acid-binding immunoglobulin-like lectin involved in immune regulation within the tumor microenvironment. In NSCLC, elevated SIGLEC9 expression has been associated with immunosuppressive myeloid cell infiltration, potentially contributing to tumor immune evasion and poorer prognosis. Its expression may influence patient survival by modulating anti-tumor immune responses and impacting the efficacy of immunotherapies.",
  "CBX4": "CBX4 is a gene encoding a component of the Polycomb repressive complex involved in epigenetic regulation of gene expression. In NSCLC, elevated CBX4 expression has been associated with tumor progression, metastasis, and poorer overall survival, likely due to its role in promoting cancer cell proliferation and resistance to apoptosis. Thus, CBX4 may serve as a prognostic biomarker and potential therapeutic target influencing patient survival outcomes.",
  "RPL28": "RPL28 encodes a ribosomal protein that is part of the 60S subunit involved in protein synthesis. In NSCLC, altered expression of RPL28 has been associated with tumor progression and may reflect dysregulated translational control contributing to cancer cell proliferation. Elevated RPL28 levels could correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "KCNJ6": "KCNJ6 is a gene encoding an inward-rectifier potassium channel involved in regulating cellular electrical activity. In the context of NSCLC, altered expression or mutations in KCNJ6 have been associated with tumor progression and may influence cancer cell proliferation and apoptosis. Its dysregulation could impact patient survival by modulating tumor aggressiveness and response to therapy, making it a potential prognostic biomarker.",
  "PTPRZ1": "PTPRZ1 is a gene encoding a receptor-type protein tyrosine phosphatase involved in cell signaling pathways that regulate cell growth and migration. In NSCLC, aberrant expression or mutation of PTPRZ1 has been associated with tumor progression and poor prognosis, potentially by promoting invasive behavior and resistance to targeted therapies. Its status may serve as a biomarker for aggressive disease and influence survival outcomes by impacting tumor aggressiveness and treatment response.",
  "NPY4R": "NPY4R encodes the Neuropeptide Y receptor Y4, a G-protein coupled receptor involved in neuropeptide signaling pathways. Although its direct role in NSCLC is not fully established, emerging evidence suggests that altered NPY4R expression may influence tumor microenvironment interactions and cellular proliferation. Consequently, NPY4R expression levels could serve as a potential prognostic biomarker, where dysregulation might correlate with poorer survival outcomes in NSCLC patients.",
  "TTC28": "TTC28 is a gene encoding a tetratricopeptide repeat domain-containing protein involved in cell cycle regulation and mitotic progression. In NSCLC, alterations or expression changes in TTC28 have been associated with tumor proliferation and may correlate with poorer prognosis. Its dysregulation could influence patient survival by promoting aggressive tumor behavior and resistance to standard therapies.",
  "GTF2H2": "GTF2H2 is a gene encoding a subunit of the transcription factor IIH complex involved in DNA repair and transcription initiation. In NSCLC, alterations or expression changes in GTF2H2 may impact tumor cell DNA repair capacity, influencing sensitivity to chemotherapy and radiotherapy. Consequently, its status can be associated with patient survival outcomes, where impaired function may correlate with poorer prognosis due to genomic instability.",
  "KHSRP": "KHSRP is a gene encoding an RNA-binding protein involved in mRNA decay and regulation of gene expression. In NSCLC, altered KHSRP expression has been associated with tumor progression and poor prognosis, likely due to its role in modulating oncogenic pathways and inflammatory responses. Elevated KHSRP levels may contribute to reduced patient survival by promoting tumor growth and resistance to apoptosis.",
  "FHIT": "FHIT (Fragile Histidine Triad) is a tumor suppressor gene frequently altered in non-small cell lung cancer (NSCLC), involved in DNA damage response and apoptosis pathways. Loss or reduced expression of FHIT is associated with increased tumor aggressiveness and poorer prognosis. Consequently, FHIT status can serve as a prognostic biomarker, where its inactivation often correlates with decreased overall survival in NSCLC patients.",
  "REPIN1": "REPIN1 is a gene involved in DNA replication and repair processes. In the context of NSCLC, altered expression or mutations in REPIN1 have been associated with tumor progression and resistance to certain therapies, potentially serving as a prognostic biomarker. Its dysregulation may contribute to poorer survival outcomes by promoting genomic instability and aggressive tumor behavior.",
  "LAPTM5": "LAPTM5 is a gene encoding a lysosomal-associated transmembrane protein involved in immune cell signaling and lysosomal function. In NSCLC, elevated LAPTM5 expression has been associated with enhanced tumor immune microenvironment modulation and may correlate with poorer prognosis due to its role in promoting tumor progression and resistance to therapy. Consequently, LAPTM5 expression levels can influence patient survival outcomes by impacting tumor aggressiveness and response to immunotherapy.",
  "R3HDM4": "R3HDM4 is a gene that encodes a protein involved in RNA binding and regulation of gene expression. In the context of NSCLC, alterations or expression levels of R3HDM4 have been associated with tumor progression and may serve as a prognostic biomarker. Elevated or dysregulated R3HDM4 expression could influence patient survival by affecting tumor aggressiveness and response to therapy.",
  "SAMD9": "SAMD9 is a gene involved in cellular growth regulation and immune response modulation. In NSCLC, alterations or dysregulation of SAMD9 have been associated with tumor progression and may correlate with poorer prognosis. Its expression or mutation status could influence patient survival by affecting tumor aggressiveness and response to therapy.",
  "PTPRG": "PTPRG encodes a receptor-type protein tyrosine phosphatase involved in cell signaling and tumor suppression. In NSCLC, reduced PTPRG expression or loss-of-function mutations have been associated with enhanced tumor progression and poorer prognosis. Its alteration may contribute to aggressive disease behavior, thereby negatively impacting patient survival outcomes.",
  "ICOS": "ICOS (Inducible T-cell COStimulator) is a gene encoding a co-stimulatory receptor expressed on activated T cells, playing a key role in modulating anti-tumor immune responses. In NSCLC, higher ICOS expression is often associated with enhanced immune activation and may correlate with improved response to immunotherapy and better overall survival. Thus, ICOS serves as a potential biomarker for prognosis and therapeutic stratification in NSCLC patients.",
  "SIM1": "SIM1 is a gene encoding a transcription factor involved in neurodevelopmental pathways. In the context of NSCLC, altered SIM1 expression has been associated with tumor progression and may serve as a prognostic biomarker. Elevated or dysregulated SIM1 levels can correlate with poorer survival outcomes, potentially by influencing tumor growth and metastatic potential.",
  "POLR2J4": "POLR2J4 is a gene encoding a subunit of RNA polymerase II, involved in transcription regulation. In NSCLC, altered expression of POLR2J4 has been associated with tumor progression and poor prognosis, potentially by affecting gene transcription programs linked to cancer cell proliferation. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting tumor growth and resistance to therapy.",
  "P2RX5": "P2RX5 is a gene encoding a purinergic receptor involved in ATP-gated ion channel activity, influencing cellular signaling and inflammation. In NSCLC, altered expression of P2RX5 has been associated with tumor progression and immune microenvironment modulation, potentially impacting tumor growth and metastasis. Its expression levels may serve as a prognostic biomarker, where dysregulation could correlate with poorer survival outcomes by affecting tumor aggressiveness and response to therapy.",
  "SEPTIN10": "SEPTIN10 is a gene encoding a member of the septin family of GTP-binding proteins involved in cytoskeletal organization and cell division. In NSCLC, altered expression or mutation of SEPTIN10 has been associated with tumor progression and may correlate with poorer prognosis by promoting cancer cell proliferation and metastasis. Its status could serve as a potential biomarker for survival outcomes and guide therapeutic strategies targeting cytoskeletal dynamics.",
  "UGT2A3": "UGT2A3 is a gene encoding a UDP-glucuronosyltransferase enzyme involved in phase II drug metabolism, facilitating the glucuronidation and clearance of endogenous and exogenous compounds. In NSCLC, altered expression or polymorphisms in UGT2A3 may affect the metabolism of chemotherapeutic agents and carcinogens, potentially influencing tumor behavior and treatment response. Consequently, UGT2A3 activity can impact patient survival by modulating drug efficacy and toxicity profiles.",
  "VPS9D1": "VPS9D1 is a gene encoding a guanine nucleotide exchange factor involved in endosomal trafficking and cellular signaling pathways. In NSCLC, altered expression or mutations in VPS9D1 have been associated with tumor progression and may impact cellular proliferation and metastasis. Its dysregulation could serve as a prognostic biomarker, potentially correlating with poorer survival outcomes by promoting aggressive tumor behavior.",
  "LAMA4": "LAMA4 encodes the laminin subunit alpha-4, a key component of the extracellular matrix involved in cell adhesion and migration. In NSCLC, elevated LAMA4 expression has been associated with enhanced tumor invasiveness and poorer prognosis, potentially by promoting metastatic potential. Thus, LAMA4 may serve as a prognostic biomarker influencing patient survival outcomes and could represent a target for therapies aimed at limiting tumor progression.",
  "TMEM185B": "TMEM185B is a gene encoding a transmembrane protein implicated in cellular transport processes. In the context of NSCLC, altered expression of TMEM185B has been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation could influence patient survival by affecting tumor cell behavior and response to therapy, thereby impacting overall outcomes.",
  "DGKE": "DGKE (Diacylglycerol Kinase Epsilon) is a gene involved in lipid signaling pathways that regulate cellular proliferation and apoptosis. In NSCLC, altered DGKE expression or mutation may impact tumor growth dynamics and response to therapy, potentially serving as a prognostic biomarker. Its dysregulation could influence patient survival by modulating oncogenic signaling and tumor microenvironment interactions.",
  "TEX14": "TEX14 is a gene encoding a protein involved in germ cell development and has emerging relevance in cancer biology. In NSCLC, altered TEX14 expression has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role suggests potential utility in stratifying patients for risk and tailoring therapeutic strategies.",
  "ALDOA": "ALDOA encodes aldolase A, a key glycolytic enzyme involved in energy metabolism. In NSCLC, elevated ALDOA expression is associated with enhanced tumor glycolysis, promoting cancer cell proliferation and metastasis, which correlates with poorer patient prognosis. Thus, ALDOA serves as a potential prognostic biomarker and therapeutic target influencing survival outcomes in NSCLC.",
  "SIRT5": "SIRT5 is a gene encoding a mitochondrial sirtuin involved in regulating metabolic and oxidative stress pathways. In NSCLC, altered SIRT5 expression has been associated with tumor progression and chemoresistance, potentially impacting prognosis. Elevated SIRT5 activity may promote cancer cell survival and metabolic adaptation, thereby correlating with poorer patient survival outcomes.",
  "PPFIBP2": "PPFIBP2 is a gene encoding a protein involved in cell adhesion and signaling pathways that regulate tumor cell migration. In NSCLC, altered expression of PPFIBP2 has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Elevated or dysregulated PPFIBP2 expression may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "CDK4": "CDK4 is a gene encoding cyclin-dependent kinase 4, a key regulator of cell cycle progression through the G1 phase. In NSCLC, CDK4 amplification or overexpression is associated with increased tumor proliferation and has been linked to poorer prognosis and resistance to certain therapies. Targeting CDK4 with specific inhibitors may improve survival outcomes by halting tumor growth in patients with CDK4-driven NSCLC.",
  "CTSV": "CTSV (Cathepsin V) is a gene encoding a lysosomal cysteine protease involved in protein degradation and extracellular matrix remodeling. In NSCLC, elevated CTSV expression has been associated with enhanced tumor invasion and metastasis, correlating with poorer prognosis. Its overexpression may contribute to aggressive tumor behavior, thereby negatively impacting patient survival outcomes.",
  "TLL2": "TLL2 (Tolloid Like 2) is a gene encoding a metalloprotease involved in extracellular matrix remodeling. In NSCLC, altered expression or mutation of TLL2 has been associated with tumor progression and may impact the tumor microenvironment, influencing cancer invasiveness. Its dysregulation could correlate with poorer survival outcomes by promoting metastatic potential and resistance to therapy.",
  "ZNF654": "ZNF654 is a gene encoding a zinc finger protein involved in transcriptional regulation. In NSCLC, altered expression of ZNF654 has been associated with tumor progression and poorer prognosis, potentially by influencing pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and could impact patient survival by promoting tumor growth and resistance to therapy.",
  "C1QB": "C1QB is a gene encoding a subunit of the complement component C1q, involved in the classical complement pathway and immune response modulation. In NSCLC, elevated C1QB expression has been associated with enhanced tumor immune microenvironment activity and may correlate with improved patient prognosis by promoting anti-tumor immunity. Thus, C1QB expression levels could serve as a potential biomarker for survival outcomes and guide immunotherapeutic strategies.",
  "NIBAN1": "NIBAN1 is a gene involved in cellular stress response and apoptosis regulation, frequently studied in the context of tumor biology. In NSCLC, elevated NIBAN1 expression has been associated with tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Its overexpression may correlate with reduced patient survival by promoting tumor aggressiveness and therapy resistance.",
  "CEP97": "CEP97 is a gene encoding a centrosomal protein involved in regulating ciliogenesis and cell cycle progression. In NSCLC, aberrant expression of CEP97 has been associated with tumor cell proliferation and metastasis, potentially serving as a biomarker for aggressive disease. Elevated CEP97 levels may correlate with poorer survival outcomes by promoting tumor growth and resistance to conventional therapies.",
  "DCLK1": "DCLK1 (Doublecortin-like kinase 1) is a gene encoding a serine/threonine kinase involved in regulating cancer stem cell properties and tumor progression. In NSCLC, elevated DCLK1 expression has been associated with enhanced tumor aggressiveness, resistance to therapy, and poorer prognosis. Consequently, high DCLK1 levels may predict reduced overall survival and serve as a potential therapeutic target to improve patient outcomes.",
  "RPL13": "RPL13 is a gene encoding a ribosomal protein involved in protein synthesis and cellular growth. In NSCLC, altered expression of RPL13 has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and resistance to apoptosis. Elevated RPL13 levels may therefore correlate with reduced patient survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "WT1": "WT1 (Wilms Tumor 1) is a gene encoding a transcription factor involved in cell growth and differentiation. In NSCLC, aberrant WT1 expression has been associated with tumor progression and poor prognosis, potentially serving as a biomarker for aggressive disease. Elevated WT1 levels may correlate with reduced survival, influencing treatment decisions and risk stratification.",
  "OPTN": "OPTN (optineurin) is a gene involved in autophagy and cellular stress response pathways. In NSCLC, altered OPTN expression or mutations have been associated with tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Its dysregulation may influence patient survival by promoting cancer cell survival and impacting response to therapy.",
  "WHRN": "WHRN (Whirlin) is a gene encoding a scaffolding protein involved in cytoskeletal organization and cellular signaling. Although its role in NSCLC is not fully established, emerging evidence suggests that altered WHRN expression may impact tumor cell adhesion and migration, potentially influencing metastatic potential. Consequently, WHRN expression levels could serve as a prognostic biomarker, where dysregulation may correlate with poorer survival outcomes in NSCLC patients.",
  "TTYH1": "TTYH1 is a gene encoding a calcium-activated chloride channel implicated in cellular signaling and volume regulation. In NSCLC, altered TTYH1 expression has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and metastasis. Its expression level may serve as a biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "DIAPH3": "DIAPH3 is a gene encoding a formin protein involved in actin cytoskeleton remodeling and cell motility. In NSCLC, altered DIAPH3 expression has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Elevated DIAPH3 levels may correlate with poorer survival outcomes by promoting invasive tumor behavior and resistance to therapy.",
  "PPP1R3D": "PPP1R3D is a gene encoding a regulatory subunit of protein phosphatase 1 involved in glycogen metabolism. In the context of NSCLC, altered expression or mutation of PPP1R3D may impact tumor cell metabolism and proliferation, potentially serving as a prognostic biomarker. Its dysregulation could influence patient survival by modulating pathways related to cancer growth and treatment resistance.",
  "TRNAU1AP": "TRNAU1AP is a gene encoding a protein involved in the maturation of selenocysteine tRNA, which is critical for the synthesis of selenoproteins with antioxidant functions. In the context of NSCLC, altered expression of TRNAU1AP may impact tumor oxidative stress responses and cellular survival pathways, potentially influencing tumor progression and resistance to therapy. Consequently, its expression levels could serve as a prognostic biomarker, where dysregulation is associated with poorer survival outcomes in NSCLC patients.",
  "ZBTB22": "ZBTB22 is a gene encoding a zinc finger transcription factor involved in regulating gene expression. In NSCLC, altered expression or mutations in ZBTB22 have been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence patient survival by affecting pathways related to cell proliferation and apoptosis, potentially impacting treatment response and disease aggressiveness.",
  "DNAJA1": "DNAJA1 is a gene encoding a member of the Hsp40 family of molecular chaperones involved in protein folding and stress response. In NSCLC, altered expression of DNAJA1 has been associated with tumor progression and chemoresistance, potentially impacting cellular stress tolerance. Elevated DNAJA1 levels may correlate with poorer survival outcomes by promoting cancer cell survival and resistance to therapy.",
  "AOX1": "AOX1 (Aldehyde Oxidase 1) is a gene encoding an enzyme involved in the metabolism of xenobiotics and endogenous compounds. In NSCLC, altered AOX1 expression has been associated with tumor progression and chemoresistance, potentially impacting metabolic pathways that influence cancer cell survival. Elevated or dysregulated AOX1 activity may correlate with poorer patient prognosis by promoting tumor aggressiveness and reducing treatment efficacy.",
  "SUV39H2": "SUV39H2 is a gene encoding a histone methyltransferase involved in chromatin modification and gene silencing. In NSCLC, overexpression of SUV39H2 has been associated with tumor progression and poor prognosis, likely due to its role in promoting oncogenic pathways and epigenetic dysregulation. Elevated SUV39H2 levels may correlate with reduced patient survival, making it a potential biomarker for aggressive disease and a target for epigenetic therapies.",
  "PSME4": "PSME4 encodes a proteasome activator involved in protein degradation and antigen processing, impacting immune response regulation. In NSCLC, altered PSME4 expression has been associated with tumor progression and immune evasion, potentially influencing responsiveness to immunotherapy. Elevated or dysregulated PSME4 levels may correlate with poorer survival outcomes by promoting tumor growth and reducing effective anti-tumor immunity.",
  "SIGLEC1": "SIGLEC1 is a gene encoding a sialic acid-binding immunoglobulin-like lectin primarily expressed on macrophages, involved in immune regulation and antigen presentation. In NSCLC, elevated SIGLEC1 expression has been associated with enhanced anti-tumor immune responses and improved patient prognosis, likely reflecting a more active tumor microenvironment. Consequently, higher SIGLEC1 levels may correlate with better survival outcomes by promoting effective immune surveillance and response to immunotherapy.",
  "BNIP2": "BNIP2 is a gene involved in the regulation of apoptosis and cellular stress responses. In the context of NSCLC, altered expression of BNIP2 has been associated with tumor progression and resistance to therapy, potentially impacting disease aggressiveness. Its dysregulation may influence patient survival by modulating cancer cell survival pathways, making it a candidate biomarker for prognosis and therapeutic targeting.",
  "AGGF1": "AGGF1 (Angiogenic Factor with G-patch and FHA Domains 1) is a gene involved in angiogenesis and vascular development. In NSCLC, elevated AGGF1 expression has been associated with enhanced tumor angiogenesis, promoting tumor growth and metastasis, which correlates with poorer patient prognosis. Thus, AGGF1 may serve as a potential biomarker for aggressive disease and a target for anti-angiogenic therapies to improve survival outcomes.",
  "SCLY": "SCLY encodes selenocysteine lyase, an enzyme involved in selenium metabolism and redox homeostasis. In NSCLC, altered SCLY expression has been associated with tumor progression and resistance to oxidative stress, potentially impacting tumor aggressiveness. Elevated or dysregulated SCLY activity may correlate with poorer survival outcomes by promoting cancer cell survival under oxidative conditions, making it a candidate biomarker for prognosis and therapeutic targeting.",
  "PIK3R1": "PIK3R1 encodes the regulatory subunit of PI3K, a key component of the PI3K/AKT signaling pathway involved in cell growth and survival. In NSCLC, alterations or dysregulation of PIK3R1 can contribute to tumor progression and resistance to targeted therapies. Its status may serve as a prognostic biomarker, where aberrations are often associated with poorer survival outcomes due to enhanced oncogenic signaling.",
  "PSD": "PSD in the context of NSCLC survival analysis typically refers to the gene *PSD* (Postsynaptic Density Protein), which is involved in synaptic signaling pathways. Although primarily studied in neurological contexts, emerging evidence suggests aberrant expression or mutation of PSD-related genes may influence tumor cell communication and microenvironment interactions in NSCLC. Alterations in PSD could impact tumor progression and patient survival by modulating pathways linked to cell adhesion and signaling, potentially serving as a prognostic biomarker or therapeutic target.",
  "ZNF135": "ZNF135 is a gene encoding a zinc finger protein involved in transcriptional regulation. In NSCLC, altered expression or mutation of ZNF135 has been associated with tumor progression and poorer prognosis, potentially by influencing pathways related to cell proliferation and metastasis. Its status may serve as a prognostic biomarker, where dysregulation correlates with reduced overall survival and could inform risk stratification or targeted therapeutic approaches.",
  "ZNF518A": "ZNF518A is a gene encoding a zinc finger protein involved in transcriptional regulation. In NSCLC, altered expression or mutations in ZNF518A have been associated with tumor progression and poorer prognosis, potentially by influencing pathways related to cell proliferation and apoptosis. Its dysregulation may serve as a biomarker for aggressive disease and could impact patient survival by promoting resistance to standard therapies.",
  "MRPS18B": "MRPS18B encodes a mitochondrial ribosomal protein involved in mitochondrial protein synthesis and cellular energy metabolism. In NSCLC, altered expression of MRPS18B has been associated with tumor progression and poorer prognosis, likely due to its role in supporting cancer cell bioenergetics and survival. Consequently, MRPS18B may serve as a potential biomarker for aggressive disease and could influence patient survival by promoting tumor growth and resistance to therapy.",
  "SYTL2": "SYTL2 is a gene encoding a synaptotagmin-like protein involved in vesicle trafficking and membrane dynamics. In NSCLC, altered SYTL2 expression has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Elevated SYTL2 levels may correlate with poorer survival outcomes by promoting aggressive tumor behavior and resistance to therapy.",
  "LILRB2": "LILRB2 is a gene encoding an immune inhibitory receptor expressed on myeloid cells, involved in modulating immune responses within the tumor microenvironment. In NSCLC, elevated LILRB2 expression has been associated with immune evasion and poorer prognosis, potentially by suppressing anti-tumor immunity. Its activity may influence patient survival by promoting tumor progression and resistance to immunotherapy.",
  "PLEKHA6": "PLEKHA6 is a gene encoding a pleckstrin homology domain-containing protein involved in intracellular signaling pathways. In the context of NSCLC, altered expression or mutation of PLEKHA6 has been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence cell proliferation and survival, potentially impacting patient outcomes by correlating with more aggressive disease and reduced overall survival.",
  "PSORS1C1": "PSORS1C1 is a gene located within the major histocompatibility complex region, implicated in immune regulation. In the context of NSCLC, altered expression or genetic variants of PSORS1C1 have been associated with modulating tumor immune microenvironment and may influence response to immunotherapy. Its status could serve as a prognostic biomarker, where differential expression correlates with patient survival outcomes by affecting tumor-immune interactions.",
  "PSME3IP1": "PSME3IP1 is a gene involved in proteasome regulation and protein degradation pathways. In the context of NSCLC, altered expression of PSME3IP1 has been associated with tumor progression and may impact cellular stress responses. Its dysregulation could influence patient survival by affecting tumor aggressiveness and response to therapy, making it a potential prognostic biomarker.",
  "CTSZ": "CTSZ (Cathepsin Z) is a gene encoding a lysosomal cysteine protease involved in protein degradation and extracellular matrix remodeling. In NSCLC, elevated CTSZ expression has been associated with enhanced tumor invasiveness and immune modulation, potentially contributing to poorer prognosis. Its activity may influence patient survival by promoting metastatic progression and impacting the tumor microenvironment, making it a candidate biomarker for aggressive disease and therapeutic targeting.",
  "PPIEL": "PPIEL is a gene encoding a peptidyl-prolyl cis-trans isomerase involved in protein folding and cellular stress responses. In NSCLC, altered expression or mutation of PPIEL has been associated with tumor progression and resistance to chemotherapy, potentially serving as a biomarker for aggressive disease. Its dysregulation may negatively impact patient survival by promoting cancer cell survival and treatment evasion.",
  "IL10": "IL10 is a gene encoding the anti-inflammatory cytokine interleukin-10, which modulates immune responses within the tumor microenvironment of non-small cell lung cancer (NSCLC). Elevated IL10 expression is often associated with immunosuppression, facilitating tumor immune evasion and correlating with poorer prognosis. Consequently, IL10 levels may influence patient survival by impacting the effectiveness of anti-tumor immunity and response to immunotherapies.",
  "PKNOX2": "PKNOX2 is a gene encoding a transcription factor involved in regulating gene expression and cellular differentiation. In NSCLC, altered PKNOX2 expression or mutation has been associated with tumor progression and may serve as a prognostic biomarker, where dysregulation can correlate with poorer survival outcomes. Its impact on survival likely reflects its role in modulating pathways related to tumor growth and metastasis, making it a potential target for therapeutic intervention.",
  "SURF1": "SURF1 is a gene encoding a mitochondrial protein involved in cytochrome c oxidase assembly, critical for cellular respiration. In NSCLC, altered SURF1 expression or mutations may impact tumor metabolism and mitochondrial function, potentially influencing tumor aggressiveness and response to therapy. Consequently, SURF1 status could serve as a prognostic biomarker, where dysregulation is associated with poorer survival outcomes due to impaired cellular energy homeostasis.",
  "CARD14": "CARD14 is a gene encoding a scaffold protein involved in NF-κB signaling pathways that regulate inflammation and cell survival. In NSCLC, aberrations in CARD14 expression or mutation may modulate tumor-promoting inflammation and immune responses, potentially impacting tumor progression. Altered CARD14 activity could influence patient survival by affecting tumor aggressiveness and response to targeted or immunotherapies.",
  "LRRN3": "LRRN3 is a gene encoding a leucine-rich repeat neuronal protein implicated in cell signaling pathways. In NSCLC, altered expression of LRRN3 has been associated with tumor progression and poor prognosis, potentially reflecting aggressive tumor biology. Its expression levels may serve as a prognostic biomarker, where higher LRRN3 correlates with reduced overall survival, aiding risk stratification and therapeutic decision-making.",
  "DAZAP2": "DAZAP2 is a gene encoding an RNA-binding protein involved in post-transcriptional regulation. In NSCLC, altered expression of DAZAP2 has been associated with tumor progression and may serve as a prognostic biomarker, where lower expression correlates with poorer survival outcomes. Its modulation could influence tumor cell proliferation and apoptosis, thereby impacting patient prognosis and potential therapeutic responses.",
  "PAK1": "PAK1 (p21-activated kinase 1) is a serine/threonine kinase involved in cytoskeletal remodeling and cell survival signaling pathways. In NSCLC, PAK1 overexpression or activation has been associated with enhanced tumor proliferation, metastasis, and resistance to targeted therapies, correlating with poorer prognosis. Consequently, elevated PAK1 activity may predict reduced overall survival and serve as a potential therapeutic target to improve patient outcomes.",
  "PCBD1": "PCBD1 is a gene encoding pterin-4 alpha-carbinolamine dehydratase 1, involved in tetrahydrobiopterin metabolism and transcriptional regulation. In NSCLC, altered PCBD1 expression or mutation may impact tumor cell metabolism and proliferation, potentially serving as a prognostic biomarker. Its dysregulation could influence patient survival by modulating tumor aggressiveness and response to targeted therapies.",
  "RUBCNL": "RUBCNL is a gene implicated in cellular processes such as autophagy and lysosomal function, which can influence tumor cell survival and metabolism. In NSCLC, alterations or expression changes in RUBCNL have been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation could impact patient survival by modulating cancer cell resistance to therapy and promoting aggressive disease phenotypes.",
  "UBFD1": "UBFD1 is a gene involved in the ubiquitin-proteasome pathway, which regulates protein degradation and cellular homeostasis. In NSCLC, altered UBFD1 expression has been associated with tumor progression and may impact response to targeted therapies. Its dysregulation can influence patient survival by affecting cancer cell proliferation and resistance mechanisms, making it a potential prognostic biomarker.",
  "PLOD2": "PLOD2 is a gene encoding lysyl hydroxylase 2, an enzyme involved in collagen cross-linking and extracellular matrix remodeling. In NSCLC, elevated PLOD2 expression has been associated with increased tumor invasiveness, metastasis, and poorer overall survival, likely due to its role in promoting a pro-tumorigenic microenvironment. Thus, PLOD2 serves as a potential prognostic biomarker and therapeutic target influencing patient survival outcomes.",
  "MAP1LC3C": "MAP1LC3C is a gene encoding a protein involved in autophagy, a cellular degradation pathway critical for maintaining cellular homeostasis. In NSCLC, altered expression of MAP1LC3C has been associated with tumor progression and resistance to therapy, potentially impacting tumor cell survival under stress. Elevated or dysregulated MAP1LC3C expression may correlate with poorer patient prognosis by promoting cancer cell survival and therapy resistance, thus influencing overall survival outcomes.",
  "TRMT1": "TRMT1 is a gene encoding a tRNA methyltransferase involved in RNA modification and protein translation regulation. In NSCLC, altered TRMT1 expression has been associated with tumor progression and poor prognosis, potentially by affecting cellular stress responses and proliferation. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting tumor growth and resistance to therapy.",
  "GNA12": "GNA12 is a gene encoding a G protein alpha subunit involved in signaling pathways that regulate cell proliferation and migration. In NSCLC, aberrant GNA12 expression or activation has been linked to enhanced tumor aggressiveness and metastasis, correlating with poorer prognosis. Its dysregulation may contribute to resistance to targeted therapies, thereby negatively impacting patient survival outcomes.",
  "WSCD1": "WSCD1 is a gene encoding a protein involved in cellular signaling pathways that may influence tumor progression. In the context of NSCLC, altered expression or mutation of WSCD1 has been associated with tumor aggressiveness and poorer prognosis. Its dysregulation may contribute to reduced patient survival by promoting cancer cell proliferation and resistance to therapy.",
  "PUM1": "PUM1 is a gene encoding an RNA-binding protein involved in post-transcriptional regulation of gene expression. In NSCLC, elevated PUM1 expression has been associated with tumor progression and poorer prognosis, likely due to its role in promoting cancer cell proliferation and metastasis. Consequently, high PUM1 levels may correlate with reduced overall survival, making it a potential biomarker for aggressive disease and a target for therapeutic intervention.",
  "HAUS2": "HAUS2 is a gene encoding a subunit of the HAUS complex involved in microtubule organization and mitotic spindle formation. In NSCLC, aberrant expression or mutation of HAUS2 has been associated with altered tumor cell proliferation and genomic instability, potentially contributing to aggressive disease behavior. Elevated HAUS2 activity may correlate with poorer survival outcomes by promoting tumor progression and resistance to conventional therapies.",
  "ATP1B2": "ATP1B2 encodes the beta-2 subunit of the Na⁺/K⁺-ATPase, a membrane ion pump involved in maintaining cellular ion homeostasis. In NSCLC, altered expression of ATP1B2 has been associated with tumor progression and may influence cell adhesion and migration, impacting metastatic potential. Its dysregulation can correlate with poorer survival outcomes, making it a potential prognostic biomarker and therapeutic target in NSCLC management.",
  "PGA5": "PGA5 is a gene encoding pepsinogen A5, primarily involved in digestive enzyme precursor activity rather than direct oncogenic pathways. Although not commonly implicated in NSCLC pathogenesis, alterations or expression changes in PGA5 may reflect broader genomic instability or tumor microenvironment shifts. Its association with NSCLC survival is likely indirect, potentially serving as a biomarker linked to tumor differentiation status or co-occurring molecular events that influence patient prognosis.",
  "RFX3": "RFX3 is a gene encoding a transcription factor involved in regulating ciliogenesis and cellular differentiation. In NSCLC, altered expression or mutations in RFX3 have been associated with tumor progression and poorer prognosis, potentially by affecting tumor cell signaling pathways. Its dysregulation may contribute to reduced patient survival by promoting aggressive tumor behavior and resistance to standard therapies.",
  "S1PR2": "S1PR2 (Sphingosine-1-Phosphate Receptor 2) is a gene encoding a G-protein-coupled receptor involved in sphingolipid signaling pathways that regulate cell migration, proliferation, and survival. In NSCLC, altered S1PR2 expression has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Elevated or dysregulated S1PR2 activity may influence patient survival by promoting aggressive tumor behavior and resistance to therapy.",
  "ITGB5": "ITGB5 encodes integrin beta-5, a cell surface receptor involved in cell adhesion and signaling pathways that regulate tumor invasion and metastasis. In NSCLC, elevated ITGB5 expression has been associated with enhanced tumor aggressiveness and poorer prognosis, potentially by promoting epithelial-mesenchymal transition and resistance to apoptosis. Consequently, ITGB5 may serve as a prognostic biomarker and a therapeutic target influencing patient survival outcomes.",
  "YARS2": "YARS2 encodes mitochondrial tyrosyl-tRNA synthetase, a gene involved in mitochondrial protein synthesis and cellular energy metabolism. In NSCLC, altered YARS2 expression has been associated with tumor progression and may impact mitochondrial function, influencing cancer cell survival and resistance to therapy. Elevated or dysregulated YARS2 levels could therefore serve as a prognostic biomarker, potentially correlating with poorer patient survival outcomes.",
  "VPS16": "VPS16 is a gene encoding a core component of the homotypic fusion and vacuole protein sorting (HOPS) complex involved in endosomal-lysosomal trafficking. In NSCLC, alterations or dysregulation of VPS16 may impact tumor cell autophagy and intracellular degradation pathways, potentially influencing tumor progression and response to therapy. Its expression or mutation status could serve as a prognostic biomarker, where aberrant VPS16 activity is associated with poorer survival outcomes due to enhanced tumor aggressiveness or therapy resistance.",
  "MSC": "MSC refers to the gene *Musculin*, a transcription factor involved in regulating cellular differentiation and proliferation. In NSCLC, altered MSC expression has been associated with tumor progression and resistance to apoptosis, potentially contributing to more aggressive disease phenotypes. Elevated MSC levels may correlate with poorer survival outcomes by promoting tumor growth and reducing treatment responsiveness.",
  "LGALS4": "LGALS4 encodes galectin-4, a carbohydrate-binding protein involved in cell adhesion and immune modulation. In NSCLC, altered LGALS4 expression has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Elevated or dysregulated LGALS4 may correlate with poorer survival outcomes by promoting tumor invasiveness and immune evasion.",
  "SEMG2": "SEMG2 is a gene encoding semenogelin II, primarily known for its role in seminal fluid but recently investigated for aberrant expression in various cancers, including NSCLC. Although not a classical oncogene, altered SEMG2 expression may reflect tumor microenvironment changes or immune modulation, potentially serving as a novel prognostic biomarker. Its differential expression in NSCLC patients has been associated with survival outcomes, where higher or lower levels could correlate with tumor aggressiveness and patient prognosis.",
  "RELN": "RELN encodes Reelin, an extracellular matrix glycoprotein involved in neuronal migration and signaling pathways. In NSCLC, altered RELN expression or mutation has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by modulating tumor microenvironment interactions and impacting response to targeted therapies.",
  "GREB1": "GREB1 (Gene Regulated by Estrogen in Breast Cancer 1) is a gene involved in hormone-responsive pathways and has been implicated in tumor cell proliferation. In NSCLC, elevated GREB1 expression has been associated with enhanced tumor growth and poorer prognosis, potentially due to its role in promoting cancer cell survival and resistance to therapy. Thus, GREB1 may serve as a prognostic biomarker influencing patient survival outcomes and could represent a target for tailored therapeutic strategies.",
  "TCP11L1": "TCP11L1 is a gene encoding a protein involved in cellular processes such as proliferation and differentiation. In the context of NSCLC, altered expression or mutations in TCP11L1 have been associated with tumor progression and poorer prognosis. Its dysregulation may contribute to aggressive tumor behavior, thereby negatively impacting patient survival outcomes.",
  "CCNC": "CCNC (Cyclin C) is a gene encoding a regulatory subunit of the cyclin-dependent kinase complex involved in cell cycle control and transcriptional regulation. In NSCLC, altered CCNC expression or mutation may disrupt cell cycle checkpoints, contributing to tumor progression and resistance to therapy. Consequently, aberrant CCNC activity is associated with poorer survival outcomes, making it a potential prognostic biomarker and therapeutic target in NSCLC management.",
  "ZFAND1": "ZFAND1 is a gene encoding a zinc finger protein involved in proteasomal degradation and cellular stress responses. In NSCLC, altered expression of ZFAND1 has been associated with tumor progression and may correlate with poorer prognosis by promoting cancer cell survival and resistance to apoptosis. Its expression levels could serve as a potential biomarker influencing patient survival outcomes and guiding therapeutic strategies.",
  "ACSL1": "ACSL1 (Acyl-CoA Synthetase Long Chain Family Member 1) is a gene involved in fatty acid metabolism, catalyzing the activation of long-chain fatty acids. In NSCLC, altered ACSL1 expression has been associated with tumor progression and metabolic reprogramming, potentially contributing to aggressive phenotypes. Elevated ACSL1 levels may correlate with poorer survival outcomes by promoting cancer cell proliferation and resistance to therapy.",
  "RABL6": "RABL6 is a gene encoding a member of the Ras superfamily of GTPases involved in cell cycle regulation and proliferation. In NSCLC, overexpression of RABL6 has been associated with tumor progression and poor prognosis, likely due to its role in promoting cell growth and inhibiting apoptosis. Elevated RABL6 levels may therefore correlate with reduced patient survival and could serve as a potential biomarker for aggressive disease and therapeutic targeting.",
  "MS4A6A": "MS4A6A is a gene encoding a membrane-spanning protein involved in immune cell signaling. In NSCLC, altered expression of MS4A6A has been associated with tumor immune microenvironment modulation, potentially impacting response to immunotherapy. Elevated or dysregulated MS4A6A expression may correlate with improved or worsened survival outcomes by influencing anti-tumor immune activity.",
  "GPR162": "GPR162 is a gene encoding a G protein-coupled receptor implicated in cellular signaling pathways. In the context of NSCLC, altered expression or mutation of GPR162 has been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation can influence tumor behavior and patient survival by modulating pathways involved in cell proliferation and metastasis.",
  "FCGR1A": "FCGR1A encodes a high-affinity receptor for the Fc region of IgG, primarily expressed on immune cells such as macrophages and dendritic cells, playing a key role in antibody-dependent cellular phagocytosis. In NSCLC, elevated FCGR1A expression has been associated with enhanced anti-tumor immune responses and improved prognosis, potentially reflecting a more active tumor immune microenvironment. Consequently, higher FCGR1A levels may correlate with better patient survival outcomes by promoting effective immune-mediated tumor clearance.",
  "BEGAIN": "BEGAIN (Brain-Enriched Guanylate Kinase-Associated Protein) is a gene involved in synaptic signaling and cellular scaffolding, though its direct role in NSCLC is not well-characterized. Emerging evidence suggests that altered BEGAIN expression may influence tumor microenvironment interactions or signaling pathways relevant to cancer progression. In NSCLC survival analysis, differential BEGAIN expression could serve as a potential biomarker impacting patient prognosis by modulating tumor behavior or response to therapy.",
  "NES": "NES (Nestin) is an intermediate filament protein commonly used as a marker of neural stem cells and cancer stem-like cells. In NSCLC, elevated NES expression is associated with increased tumor aggressiveness, metastasis, and resistance to therapy, correlating with poorer patient prognosis. Its presence may indicate a more invasive tumor phenotype, thereby negatively impacting overall survival outcomes.",
  "TCF4": "TCF4 is a gene encoding a transcription factor involved in the Wnt/β-catenin signaling pathway, which regulates cell proliferation and differentiation. In NSCLC, aberrant TCF4 expression has been associated with tumor progression and resistance to therapy, making it a potential prognostic biomarker. Elevated TCF4 activity may correlate with poorer survival outcomes by promoting tumor aggressiveness and metastatic potential.",
  "YIF1A": "YIF1A is a gene encoding a membrane protein involved in vesicular transport between the endoplasmic reticulum and Golgi apparatus. In NSCLC, altered expression of YIF1A has been associated with tumor progression and may correlate with poorer prognosis by promoting cancer cell survival and metastasis. Its expression levels could serve as a potential biomarker to stratify patients for risk and guide therapeutic decision-making.",
  "FRMD1": "FRMD1 is a gene encoding a FERM domain-containing protein involved in cytoskeletal organization and cell adhesion. In NSCLC, altered expression or mutation of FRMD1 has been associated with tumor progression and metastasis, potentially serving as a prognostic biomarker. Its dysregulation may influence patient survival by promoting invasive tumor behavior and resistance to therapy.",
  "TMEM63A": "TMEM63A is a gene encoding a transmembrane protein involved in cellular ion transport and mechanosensation. In the context of NSCLC, altered expression of TMEM63A has been associated with tumor progression and may serve as a prognostic biomarker, where higher expression correlates with poorer survival outcomes. Its role in modulating tumor microenvironment and cell signaling pathways suggests potential impact on treatment response and disease aggressiveness.",
  "PFDN4": "PFDN4 is a gene encoding a subunit of the prefoldin complex involved in proper protein folding and cytoskeletal organization. In NSCLC, altered expression of PFDN4 has been associated with tumor progression and poor prognosis, potentially by affecting cellular stress responses and metastatic capacity. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival by promoting tumor growth and resistance to therapy.",
  "ETV1": "ETV1 is a gene encoding a transcription factor involved in regulating cell proliferation and differentiation. In NSCLC, aberrant ETV1 expression or activation has been associated with tumor progression and poor prognosis, potentially by promoting oncogenic signaling pathways. Elevated ETV1 levels may correlate with reduced survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "KIR3DS1": "KIR3DS1 is a gene encoding an activating receptor expressed on natural killer (NK) cells, involved in immune surveillance through recognition of infected or malignant cells. In NSCLC, variations in KIR3DS1 expression or genotype may modulate anti-tumor immune responses, potentially influencing tumor immune evasion and patient prognosis. Elevated or functional KIR3DS1 activity is associated with improved survival outcomes by enhancing NK cell-mediated cytotoxicity against tumor cells.",
  "SEC24B": "SEC24B is a gene encoding a component of the COPII vesicle coat involved in protein transport from the endoplasmic reticulum to the Golgi apparatus. In the context of NSCLC, altered expression or mutations in SEC24B have been associated with dysregulated cellular trafficking pathways that may contribute to tumor progression and metastasis. Its aberrant activity can influence patient survival by promoting aggressive tumor behavior and resistance to therapy, making it a potential prognostic biomarker and therapeutic target.",
  "CXCL14": "CXCL14 is a chemokine gene involved in immune cell recruitment and tumor microenvironment modulation. In NSCLC, elevated CXCL14 expression has been associated with enhanced anti-tumor immune responses and improved patient prognosis. Its presence may indicate a more favorable survival outcome by promoting immune surveillance and inhibiting tumor progression.",
  "STXBP2": "STXBP2 is a gene encoding a protein involved in vesicle trafficking and immune cell cytotoxicity. In NSCLC, altered expression of STXBP2 has been associated with tumor immune microenvironment modulation, potentially impacting response to immunotherapy. Its dysregulation may influence patient survival by affecting anti-tumor immune activity and disease progression.",
  "RFXAP": "RFXAP is a gene encoding a regulatory factor involved in MHC class II gene expression, playing a role in immune system function. In NSCLC, altered RFXAP expression or mutation may impact tumor immune evasion and antigen presentation, potentially influencing response to immunotherapy. Consequently, RFXAP status could serve as a biomarker for patient prognosis, where dysregulation may correlate with poorer survival outcomes due to impaired anti-tumor immunity.",
  "NEDD4L": "NEDD4L is a gene encoding an E3 ubiquitin ligase involved in regulating protein degradation and cellular signaling pathways. In NSCLC, altered expression or mutation of NEDD4L has been associated with tumor progression and poor prognosis, potentially by modulating pathways related to cell proliferation and apoptosis. Its dysregulation may influence patient survival by promoting more aggressive tumor behavior and resistance to therapy.",
  "TMEM62": "TMEM62 is a gene encoding a transmembrane protein implicated in cellular signaling pathways. In the context of NSCLC, altered expression of TMEM62 has been associated with tumor progression and may serve as a prognostic biomarker. Elevated or dysregulated TMEM62 expression can influence patient survival by modulating tumor aggressiveness and response to therapy.",
  "RPL32": "RPL32 is a gene encoding a ribosomal protein involved in protein synthesis and cellular growth. In NSCLC, altered expression of RPL32 has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and resistance to apoptosis. Elevated RPL32 levels may therefore correlate with reduced patient survival, making it a candidate biomarker for aggressive disease and a potential target for therapeutic intervention.",
  "BAIAP2L2": "BAIAP2L2 is a gene encoding a protein involved in actin cytoskeleton remodeling, which can influence cell motility and invasion. In the context of NSCLC, altered expression of BAIAP2L2 has been associated with tumor progression and poorer prognosis, potentially serving as a biomarker for aggressive disease. Its dysregulation may contribute to enhanced metastatic potential, thereby negatively impacting patient survival outcomes.",
  "SETD1B": "SETD1B is a gene encoding a histone methyltransferase involved in chromatin modification and regulation of gene expression. In NSCLC, alterations or dysregulation of SETD1B have been associated with tumor progression and may impact epigenetic control of oncogenic pathways. Its expression or mutation status can influence patient survival by affecting tumor aggressiveness and response to targeted therapies.",
  "BCL6": "BCL6 is a gene encoding a transcriptional repressor involved in regulating cell differentiation and apoptosis. In NSCLC, aberrant BCL6 expression has been associated with tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Elevated BCL6 activity may thus serve as a biomarker for aggressive disease and influence survival outcomes by promoting tumor cell survival and therapy resistance.",
  "INVS": "INVS (Inversin) is a gene involved in primary cilia function and cellular signaling pathways, including Wnt signaling, which can influence tumor behavior. In NSCLC, altered INVS expression has been associated with tumor progression and may serve as a prognostic biomarker. Its dysregulation could impact patient survival by modulating cancer cell proliferation and metastatic potential.",
  "DBNDD1": "DBNDD1 is a gene encoding a protein involved in cellular signaling and cytoskeletal organization. In the context of NSCLC, altered expression of DBNDD1 has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell migration and invasion. Its dysregulation may serve as a biomarker for aggressive disease and could influence patient survival by contributing to metastasis and resistance to therapy.",
  "YBX1": "YBX1 is a gene encoding the Y-box binding protein 1, a transcription factor involved in regulating gene expression related to cell proliferation, DNA repair, and drug resistance. In NSCLC, overexpression of YBX1 has been associated with aggressive tumor behavior, chemoresistance, and poorer overall survival. Its elevated activity may serve as a prognostic biomarker and potential therapeutic target influencing patient outcomes.",
  "TRAF3IP2": "TRAF3IP2 is a gene encoding an adaptor protein involved in inflammatory signaling pathways, including NF-κB activation. In NSCLC, altered expression or mutations in TRAF3IP2 have been associated with tumor progression and resistance to apoptosis, potentially contributing to poorer prognosis. Its dysregulation may influence patient survival by promoting a pro-tumorigenic microenvironment and impacting response to targeted therapies.",
  "GALT": "GALT (galactose-1-phosphate uridylyltransferase) is a metabolic enzyme gene involved in galactose metabolism. In NSCLC, altered GALT expression or mutations may impact tumor cell energy utilization and oxidative stress response, potentially influencing tumor progression. Although not a widely established prognostic marker, dysregulation of GALT could affect patient survival by modulating cancer cell metabolism and treatment resistance.",
  "IL36RN": "IL36RN encodes the interleukin-36 receptor antagonist, a regulator of inflammatory signaling within the IL-1 cytokine family. In NSCLC, dysregulation of IL36RN may modulate the tumor microenvironment by altering immune responses, potentially impacting tumor progression and response to immunotherapy. Elevated or altered IL36RN expression has been associated with changes in patient survival, suggesting its role as a prognostic biomarker influencing inflammation-driven tumor behavior.",
  "OR7E24": "OR7E24 is a gene encoding an olfactory receptor, part of the G-protein-coupled receptor family, which is not traditionally associated with lung tissue function. Emerging evidence in NSCLC suggests aberrant expression of OR7E24 may correlate with tumor behavior, potentially serving as a novel biomarker. Its altered expression could influence tumor microenvironment interactions or signaling pathways, thereby impacting patient survival outcomes and offering a prospective target for prognostic assessment.",
  "LEFTY1": "LEFTY1 is a gene encoding a member of the TGF-β superfamily involved in embryonic development and cellular differentiation. In NSCLC, altered LEFTY1 expression has been associated with tumor progression and may modulate the tumor microenvironment through TGF-β signaling pathways. Its dysregulation can influence patient survival by promoting epithelial-to-mesenchymal transition and impacting tumor aggressiveness, making it a potential prognostic biomarker.",
  "PARP16": "PARP16 is a gene encoding a member of the poly (ADP-ribose) polymerase family involved in cellular stress responses and protein modification. In NSCLC, altered PARP16 expression has been linked to tumor progression and resistance to apoptosis, potentially impacting sensitivity to DNA-damaging therapies. Elevated PARP16 activity may correlate with poorer survival outcomes by promoting cancer cell survival and therapy resistance.",
  "ADCYAP1": "ADCYAP1 encodes the adenylate cyclase-activating polypeptide 1, a neuropeptide involved in cAMP signaling pathways that can influence tumor cell proliferation and immune modulation. In NSCLC, altered ADCYAP1 expression has been associated with tumor progression and poorer prognosis, potentially by promoting a pro-tumorigenic microenvironment. Its expression level may serve as a biomarker for survival outcomes, where higher ADCYAP1 correlates with reduced overall survival.",
  "CPNE3": "CPNE3 is a gene encoding Copine-3, a calcium-dependent phospholipid-binding protein involved in cell signaling and membrane trafficking. In NSCLC, overexpression of CPNE3 has been associated with enhanced tumor cell migration and invasion, correlating with poorer prognosis and reduced overall survival. Its expression may serve as a potential biomarker for aggressive disease and could influence treatment stratification.",
  "FCRL2": "FCRL2 (Fc receptor-like 2) is a gene encoding a protein involved in immune regulation, primarily expressed on B cells. In NSCLC, elevated FCRL2 expression has been associated with enhanced anti-tumor immune responses and may correlate with improved patient survival by modulating tumor microenvironment immunity. Thus, FCRL2 serves as a potential prognostic biomarker reflecting immune activity that could influence responsiveness to immunotherapy.",
  "TMEM187": "TMEM187 is a gene encoding a transmembrane protein whose expression levels have been investigated in non-small cell lung cancer (NSCLC). Although not extensively characterized, emerging evidence suggests that altered TMEM187 expression may be associated with tumor progression and could serve as a prognostic biomarker. Its dysregulation might influence NSCLC patient survival by affecting cellular pathways involved in tumor growth or metastasis, thereby impacting treatment response and overall prognosis.",
  "ZC3H13": "ZC3H13 is a gene encoding a zinc finger CCCH-type containing protein involved in RNA methylation and regulation of gene expression. In NSCLC, altered ZC3H13 expression has been associated with tumor progression and poor prognosis, potentially by modulating oncogenic signaling pathways. Its dysregulation may influence patient survival by affecting tumor growth, metastasis, and response to therapy.",
  "BAG1": "BAG1 is a gene encoding a multifunctional co-chaperone protein involved in apoptosis regulation and cell survival pathways. In NSCLC, elevated BAG1 expression has been associated with resistance to chemotherapy and poorer prognosis, likely due to its role in inhibiting apoptotic cell death. Consequently, BAG1 status may influence patient survival by modulating tumor response to treatment and disease progression.",
  "LINC00667": "LINC00667 is a long non-coding RNA (lncRNA) implicated in the regulation of gene expression in non-small cell lung cancer (NSCLC). Elevated LINC00667 expression has been associated with tumor progression, metastasis, and poorer overall survival, likely by promoting oncogenic pathways such as epithelial-mesenchymal transition. Its expression level may serve as a prognostic biomarker to stratify NSCLC patients and guide therapeutic decision-making.",
  "POU5F1P4": "POU5F1P4 is a pseudogene related to the POU5F1 (OCT4) transcription factor, which is involved in stem cell pluripotency and differentiation. Although POU5F1P4 itself is non-coding, its expression or epigenetic regulation may reflect stemness-related pathways that contribute to tumor aggressiveness in NSCLC. Elevated activity linked to this pseudogene has been associated with poorer survival outcomes, potentially by promoting cancer cell plasticity and resistance to conventional therapies.",
  "SPART": "SPART is a gene encoding spartin, a protein involved in mitochondrial function and endosomal trafficking. In NSCLC, alterations or dysregulation of SPART have been associated with tumor progression and may impact cellular metabolism and apoptosis pathways. Its expression levels or mutational status could serve as a prognostic biomarker, potentially influencing patient survival by modulating tumor aggressiveness and response to therapy.",
  "ASCC3": "ASCC3 is a gene encoding a DNA helicase involved in transcription-coupled DNA repair and RNA processing. In NSCLC, altered ASCC3 expression or mutations may impact tumor cell response to DNA damage and influence resistance to chemotherapy, thereby affecting prognosis. Elevated or dysregulated ASCC3 activity has been associated with poorer survival outcomes by promoting tumor progression and therapy resistance.",
  "RAP2B": "RAP2B is a gene encoding a member of the Ras-related GTP-binding protein family involved in intracellular signaling pathways that regulate cell proliferation and migration. In NSCLC, overexpression or dysregulation of RAP2B has been associated with enhanced tumor aggressiveness and poor prognosis. Its activity may contribute to resistance to therapy and decreased overall survival by promoting tumor progression and metastasis.",
  "KCNF1": "KCNF1 encodes a voltage-gated potassium channel subunit implicated in regulating cellular excitability and proliferation. In NSCLC, aberrant expression or mutation of KCNF1 has been associated with tumor progression and poor prognosis, potentially by influencing cancer cell growth and apoptosis resistance. Its status may serve as a prognostic biomarker, where altered KCNF1 activity correlates with reduced overall survival and could inform targeted therapeutic strategies.",
  "SEC63": "SEC63 is a gene encoding a component of the endoplasmic reticulum translocon complex involved in protein folding and processing. In NSCLC, altered expression or mutations in SEC63 have been associated with dysregulated cellular stress responses, potentially contributing to tumor progression and resistance to therapy. Consequently, SEC63 status may influence patient survival by affecting tumor aggressiveness and responsiveness to treatment.",
  "CRELD2": "CRELD2 is a gene encoding a cysteine-rich epidermal growth factor-like domain-containing protein involved in endoplasmic reticulum stress response. In NSCLC, elevated CRELD2 expression has been associated with tumor progression and poorer prognosis, potentially by promoting cancer cell survival under stress conditions. Its expression level may serve as a biomarker for aggressive disease and influence patient survival by modulating tumor resilience to therapy.",
  "GOLGA1": "GOLGA1 is a gene encoding a Golgi apparatus protein involved in vesicular trafficking and protein processing. In NSCLC, altered expression of GOLGA1 has been associated with tumor progression and poor prognosis, potentially by promoting cancer cell proliferation and metastasis. Its dysregulation may serve as a biomarker for aggressive disease and influence patient survival outcomes by correlating with reduced overall survival.",
  "KIF3A": "KIF3A is a gene encoding a kinesin motor protein involved in intracellular transport and ciliary function. In NSCLC, altered expression or mutations in KIF3A have been associated with tumor progression and metastasis, potentially impacting cellular signaling pathways relevant to cancer growth. Its dysregulation may correlate with poorer survival outcomes, making it a candidate biomarker for prognosis and a potential target for therapeutic intervention.",
  "SLC8A1": "SLC8A1 is a gene encoding a sodium/calcium exchanger involved in cellular calcium homeostasis. In NSCLC, altered expression of SLC8A1 has been associated with tumor progression and may impact cell proliferation and apoptosis. Its dysregulation could influence patient survival by modulating tumor aggressiveness and response to therapy, making it a potential prognostic biomarker.",
  "INPP5A": "INPP5A is a gene encoding inositol polyphosphate-5-phosphatase A, involved in phosphoinositide signaling pathways that regulate cell proliferation and apoptosis. In NSCLC, reduced INPP5A expression has been associated with tumor progression and poorer prognosis, suggesting its potential role as a tumor suppressor. Consequently, lower INPP5A levels may correlate with decreased patient survival, highlighting its value as a prognostic biomarker and a possible therapeutic target.",
  "IFT140": "IFT140 is a gene involved in intraflagellar transport, critical for cilia function and cellular signaling pathways. In the context of NSCLC, aberrations in IFT140 expression or mutation may impact tumor cell signaling and microenvironment interactions, potentially influencing tumor progression. Although not yet a standard prognostic marker, altered IFT140 activity could be associated with differential survival outcomes by modulating pathways relevant to tumor growth and metastasis."
}